1 : Job ID 6b383f0017ca4f96ab9e5ae4b378413a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (8, 7), end pos: (8, 10)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -5,7 +5,7 @@
 def get_user_id_from_token(token: str) -> int:
-    if not token:
+    if  token:
         raise ApiError(status_code=401, message="Missing authentication auth_token")
     try:
Initializing DBUtility...
Initializing DBUtility...

2 : Job ID f63f6e2d1e514aa7a9f18d4546dac5de
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (15, 11), end pos: (15, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 1
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -12,7 +12,7 @@
         payload = jwt.decode(token, SECRET_KEY, algorithms=["HS256"])
         user_id = payload.get("sub")
-        if not user_id:
+        if  user_id:
             raise ApiError(status_code=401, message="Invalid auth_token payload")
         return int(user_id)
Initializing DBUtility...
Initializing DBUtility...

3 : Job ID 2131e69ed6304b4e9bf34a4df1117cc5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (8, 7), end pos: (8, 16)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -5,7 +5,7 @@
 def get_user_id_from_token(token: str) -> int:
-    if not token:
+    if not not token:
         raise ApiError(status_code=401, message="Missing authentication auth_token")
     try:
Initializing DBUtility...
Initializing DBUtility...

4 : Job ID b250dff4c32440d3806a705aeb34b681
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (15, 11), end pos: (15, 22)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -12,7 +12,7 @@
         payload = jwt.decode(token, SECRET_KEY, algorithms=["HS256"])
         user_id = payload.get("sub")
-        if not user_id:
+        if not not user_id:
             raise ApiError(status_code=401, message="Invalid auth_token payload")
         return int(user_id)
Initializing DBUtility...
Initializing DBUtility...

5 : Job ID fb80d5db446b4f219e3b78d815df95ab
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (20, 14), end pos: (20, 15)
operator: core/ExceptionReplacer, occurrence: 0
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -17,7 +17,7 @@
         return int(user_id)
-    except jwt.ExpiredSignatureError:
+    except jwtCosmicRayTestingExceptionExpiredSignatureError:
         raise ApiError(status_code=401, message="Token has expired")
     except jwt.InvalidTokenError:
Initializing DBUtility...
Initializing DBUtility...

6 : Job ID 7a31be23ff5342a1b6e5164521031582
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (23, 14), end pos: (23, 15)
operator: core/ExceptionReplacer, occurrence: 1
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -20,7 +20,7 @@
     except jwt.ExpiredSignatureError:
         raise ApiError(status_code=401, message="Token has expired")
-    except jwt.InvalidTokenError:
+    except jwtCosmicRayTestingExceptionInvalidTokenError:
         raise ApiError(status_code=401, message="Invalid auth_token")
     except ValueError:
Initializing DBUtility...
Initializing DBUtility...

7 : Job ID 5abf170db1444683abe1fe9e12918feb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (26, 11), end pos: (26, 21)
operator: core/ExceptionReplacer, occurrence: 2
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -23,6 +23,6 @@
     except jwt.InvalidTokenError:
         raise ApiError(status_code=401, message="Invalid auth_token")
-    except ValueError:
+    except CosmicRayTestingException:
         raise ApiError(status_code=401, message="Invalid user ID in auth_token")
Initializing DBUtility...
Initializing DBUtility...

8 : Job ID 75ee6740df114ec8ae7c196aca0d4f40
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (9, 35), end pos: (9, 38)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -6,7 +6,7 @@
 def get_user_id_from_token(token: str) -> int:
     if not token:
-        raise ApiError(status_code=401, message="Missing authentication auth_token")
+        raise ApiError(status_code= 402, message="Missing authentication auth_token")
     try:
         payload = jwt.decode(token, SECRET_KEY, algorithms=["HS256"])
Initializing DBUtility...
Initializing DBUtility...

9 : Job ID f4abda3fe4f945e8847cbcd657abb4be
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (9, 35), end pos: (9, 38)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -6,7 +6,7 @@
 def get_user_id_from_token(token: str) -> int:
     if not token:
-        raise ApiError(status_code=401, message="Missing authentication auth_token")
+        raise ApiError(status_code= 400, message="Missing authentication auth_token")
     try:
         payload = jwt.decode(token, SECRET_KEY, algorithms=["HS256"])
Initializing DBUtility...
Initializing DBUtility...

10 : Job ID 4c62b160bdef44f8b56de250d2b84eb0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (16, 39), end pos: (16, 42)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -13,7 +13,7 @@
         user_id = payload.get("sub")
         if not user_id:
-            raise ApiError(status_code=401, message="Invalid auth_token payload")
+            raise ApiError(status_code= 402, message="Invalid auth_token payload")
         return int(user_id)
Initializing DBUtility...
Initializing DBUtility...

11 : Job ID c167ea5503c44d1681521b11c3b2e198
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (16, 39), end pos: (16, 42)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -13,7 +13,7 @@
         user_id = payload.get("sub")
         if not user_id:
-            raise ApiError(status_code=401, message="Invalid auth_token payload")
+            raise ApiError(status_code= 400, message="Invalid auth_token payload")
         return int(user_id)
Initializing DBUtility...
Initializing DBUtility...

12 : Job ID ab2c2ce8a4c746d1a085ea8f82ace401
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (21, 35), end pos: (21, 38)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -18,7 +18,7 @@
         return int(user_id)
     except jwt.ExpiredSignatureError:
-        raise ApiError(status_code=401, message="Token has expired")
+        raise ApiError(status_code= 402, message="Token has expired")
     except jwt.InvalidTokenError:
         raise ApiError(status_code=401, message="Invalid auth_token")
Initializing DBUtility...
Initializing DBUtility...

13 : Job ID cc9d33579f3e4d8dabd1ef54b4f5e5e7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (21, 35), end pos: (21, 38)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -18,7 +18,7 @@
         return int(user_id)
     except jwt.ExpiredSignatureError:
-        raise ApiError(status_code=401, message="Token has expired")
+        raise ApiError(status_code= 400, message="Token has expired")
     except jwt.InvalidTokenError:
         raise ApiError(status_code=401, message="Invalid auth_token")
Initializing DBUtility...
Initializing DBUtility...

14 : Job ID dbf83b353e3e457d9c10665534ccaa2e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (24, 35), end pos: (24, 38)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -21,7 +21,7 @@
         raise ApiError(status_code=401, message="Token has expired")
     except jwt.InvalidTokenError:
-        raise ApiError(status_code=401, message="Invalid auth_token")
+        raise ApiError(status_code= 402, message="Invalid auth_token")
     except ValueError:
         raise ApiError(status_code=401, message="Invalid user ID in auth_token")
Initializing DBUtility...
Initializing DBUtility...

15 : Job ID e4da377b251941b4bc1e1aa2414476d9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (24, 35), end pos: (24, 38)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -21,7 +21,7 @@
         raise ApiError(status_code=401, message="Token has expired")
     except jwt.InvalidTokenError:
-        raise ApiError(status_code=401, message="Invalid auth_token")
+        raise ApiError(status_code= 400, message="Invalid auth_token")
     except ValueError:
         raise ApiError(status_code=401, message="Invalid user ID in auth_token")
Initializing DBUtility...
Initializing DBUtility...

16 : Job ID 76bb603487a347a9bdf2d1ebcfca9188
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (27, 35), end pos: (27, 38)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -24,5 +24,5 @@
         raise ApiError(status_code=401, message="Invalid auth_token")
     except ValueError:
-        raise ApiError(status_code=401, message="Invalid user ID in auth_token")
+        raise ApiError(status_code= 402, message="Invalid user ID in auth_token")
Initializing DBUtility...
Initializing DBUtility...

17 : Job ID 4251b7c817f446d3ab4ae658263bc5fa
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/auth/jwt.py, start pos: (27, 35), end pos: (27, 38)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- asrc/auth/jwt.py
+++ bsrc/auth/jwt.py
@@ -24,5 +24,5 @@
         raise ApiError(status_code=401, message="Invalid auth_token")
     except ValueError:
-        raise ApiError(status_code=401, message="Invalid user ID in auth_token")
+        raise ApiError(status_code= 400, message="Invalid user ID in auth_token")
Initializing DBUtility...
Initializing DBUtility...

29 : Job ID 4a476d7ea54843ffb0e01fe8c03c8f80
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (274, 28), end pos: (274, 30)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -271,7 +271,7 @@
         if account is None:
             raise ApiError(status_code=401, message="Invalid email or password")
-        if account.password != password:
+        if account.password == password:
             raise ApiError(status_code=401, message="Invalid email or password")
         # for when we implement password hashing
Initializing DBUtility...
Initializing DBUtility...

30 : Job ID 7409103b3d874d3696ea954c3b77dae2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (274, 28), end pos: (274, 30)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -271,7 +271,7 @@
         if account is None:
             raise ApiError(status_code=401, message="Invalid email or password")
-        if account.password != password:
+        if account.password < password:
             raise ApiError(status_code=401, message="Invalid email or password")
         # for when we implement password hashing
Initializing DBUtility...
Initializing DBUtility...

31 : Job ID 6396369f8fa742c19311daf1bdfb6c14
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (274, 28), end pos: (274, 30)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -271,7 +271,7 @@
         if account is None:
             raise ApiError(status_code=401, message="Invalid email or password")
-        if account.password != password:
+        if account.password <= password:
             raise ApiError(status_code=401, message="Invalid email or password")
         # for when we implement password hashing
Initializing DBUtility...
Initializing DBUtility...

32 : Job ID 388f07ffc0574bc39267eb06e07675c1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (274, 28), end pos: (274, 30)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -271,7 +271,7 @@
         if account is None:
             raise ApiError(status_code=401, message="Invalid email or password")
-        if account.password != password:
+        if account.password > password:
             raise ApiError(status_code=401, message="Invalid email or password")
         # for when we implement password hashing
Initializing DBUtility...
Initializing DBUtility...

33 : Job ID a4726bec0f14459aacf0af5d3ad70a95
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (274, 28), end pos: (274, 30)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -271,7 +271,7 @@
         if account is None:
             raise ApiError(status_code=401, message="Invalid email or password")
-        if account.password != password:
+        if account.password >= password:
             raise ApiError(status_code=401, message="Invalid email or password")
         # for when we implement password hashing
Initializing DBUtility...
Initializing DBUtility...

34 : Job ID 285914eaecce48d68746d053fedfd5cd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (274, 28), end pos: (274, 30)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -271,7 +271,7 @@
         if account is None:
             raise ApiError(status_code=401, message="Invalid email or password")
-        if account.password != password:
+        if account.password is password:
             raise ApiError(status_code=401, message="Invalid email or password")
         # for when we implement password hashing
Initializing DBUtility...
Initializing DBUtility...

35 : Job ID 08c69eae16d14ec0b79dedc415f1132c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (274, 28), end pos: (274, 30)
operator: core/ReplaceComparisonOperator_NotEq_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -271,7 +271,7 @@
         if account is None:
             raise ApiError(status_code=401, message="Invalid email or password")
-        if account.password != password:
+        if account.password is not password:
             raise ApiError(status_code=401, message="Invalid email or password")
         # for when we implement password hashing
Initializing DBUtility...
Initializing DBUtility...

36 : Job ID 1ded6b2e880c4db2b5df6da8c2aeea93
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (194, 20), end pos: (194, 22)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -191,7 +191,7 @@
         # Try to find the auth_token in database
         db_token = self.token_db.get_by_hash(token_hash)
-        if db_token is None:
+        if db_token is not None:
             raise TokenNotFoundError(
                 message="Invalid or expired verification auth_token",
                 details={"token_hash": token_hash},
Initializing DBUtility...
Initializing DBUtility...

37 : Job ID 25fca6aa21114ee284037e27bfa9069c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (247, 19), end pos: (247, 21)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -244,7 +244,7 @@
         account = self.account_manager.get_account_by_email(email)
-        if account is None:
+        if account is not None:
             raise ApiError(
                 status_code=404, message=f"Account not found for email: {email}"
             )
Initializing DBUtility...
Initializing DBUtility...

39 : Job ID 4aeceda7267a4ca1962e18d166bd2e3c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (289, 18), end pos: (289, 20)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -286,7 +286,7 @@
         return token
     def get_account_by_userid(self, userid: int) -> Account:
-        if userid is None:
+        if userid is not None:
             raise ApiError(status_code=400, message="User ID cannot be None")
         account = self.account_manager.get_account_by_id(userid)
Initializing DBUtility...
Initializing DBUtility...

40 : Job ID 6202471b307f491ca423fc4ce7187a38
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (294, 19), end pos: (294, 21)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 4
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -291,7 +291,7 @@
         account = self.account_manager.get_account_by_id(userid)
-        if account is None:
+        if account is not None:
             raise ApiError(status_code=404, message="Account not found")
         account.rating_count = self.rating_manager.count_ratings_received_by_account_id(
Initializing DBUtility...
Initializing DBUtility...

41 : Job ID 6ec64396f2504f26a79546bc4413950c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (90, 34), end pos: (90, 40)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -87,7 +87,7 @@
         except Exception:
             raise ApiError(status_code=500, message="Internal server error")
-        return created if created is not None else account
+        return created if created is None else account
     def validate_account(self, email: str, password: str, fname: str, lname: str):
         """Validates created account information
Initializing DBUtility...
Initializing DBUtility...

42 : Job ID c0c20d6f289a4b44b1ef02968ca97336
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (119, 34), end pos: (119, 35)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -116,7 +116,7 @@
         return email, password, fname, lname
     def validate_email(self, email: str):
-        domain = email.split("@")[-1]
+        domain = email.split("@")[+1]
         if domain not in ALLOWED_DOMAINS:
             raise ValidationError(
                 "Email must be a valid University of Manitoba email address "
Initializing DBUtility...
Initializing DBUtility...

43 : Job ID 0a25f8914fae4be0aaede6d294d74e22
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (119, 34), end pos: (119, 35)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -116,7 +116,7 @@
         return email, password, fname, lname
     def validate_email(self, email: str):
-        domain = email.split("@")[-1]
+        domain = email.split("@")[~1]
         if domain not in ALLOWED_DOMAINS:
             raise ValidationError(
                 "Email must be a valid University of Manitoba email address "
Initializing DBUtility...
Initializing DBUtility...

44 : Job ID 0f09c06e7d6d46e5b81d9a8613c56888
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (119, 34), end pos: (119, 35)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -116,7 +116,7 @@
         return email, password, fname, lname
     def validate_email(self, email: str):
-        domain = email.split("@")[-1]
+        domain = email.split("@")[not 1]
         if domain not in ALLOWED_DOMAINS:
             raise ValidationError(
                 "Email must be a valid University of Manitoba email address "
Initializing DBUtility...
Initializing DBUtility...

45 : Job ID 3fdf2e6fb3e44171b915b200c6067a2c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (119, 34), end pos: (119, 35)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -116,7 +116,7 @@
         return email, password, fname, lname
     def validate_email(self, email: str):
-        domain = email.split("@")[-1]
+        domain = email.split("@")[1]
         if domain not in ALLOWED_DOMAINS:
             raise ValidationError(
                 "Email must be a valid University of Manitoba email address "
Initializing DBUtility...
Initializing DBUtility...

46 : Job ID c514fbc55bbc4d40a927f9abbac79a73
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (127, 11), end pos: (127, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -124,7 +124,7 @@
             )
     def validate_password(self, password: str):
-        if not re.fullmatch(PASSWORD_REGEX, password):
+        if  re.fullmatch(PASSWORD_REGEX, password):
             raise ValidationError(
                 "Password must be at least 8 characters long and include "
                 "1 uppercase, 1 lowercase, 1 number, and no spaces."
Initializing DBUtility...
Initializing DBUtility...

47 : Job ID 633ea4cbd39d4127a9226852de909362
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (183, 11), end pos: (183, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -180,7 +180,7 @@
             TokenAlreadyUsedError: If auth_token was already used
             AccountNotFoundError: If account not found
         """
-        if not token:
+        if  token:
             raise EmailVerificationError(
                 message="Token cannot be empty", details={"auth_token": token}
             )
Initializing DBUtility...
Initializing DBUtility...

48 : Job ID 9ac2418358654875b18cea5c8ac51a70
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (242, 11), end pos: (242, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -239,7 +239,7 @@
         Raises:
             ApiError: If account not found.
         """
-        if not email:
+        if  email:
             raise ApiError(status_code=400, message="Email cannot be empty")
         account = self.account_manager.get_account_by_email(email)
Initializing DBUtility...
Initializing DBUtility...

49 : Job ID ab4bcc037e58468a822321da163d9fee
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (265, 11), end pos: (265, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -262,7 +262,7 @@
             str: A JWT auth_token for the authenticated user.
         """
-        if not email or not password:
+        if  email or not password:
             raise ApiError(status_code=400, message="Email and password are required")
         # Get account from database
Initializing DBUtility...
Initializing DBUtility...

50 : Job ID 98d1ad69ee0c4e3da0a6cc5198b2aa61
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (265, 24), end pos: (265, 27)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 4
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -262,7 +262,7 @@
             str: A JWT auth_token for the authenticated user.
         """
-        if not email or not password:
+        if not email or  password:
             raise ApiError(status_code=400, message="Email and password are required")
         # Get account from database
Initializing DBUtility...
Initializing DBUtility...

51 : Job ID 6ca03e7927df4cbfb3865725e8464b06
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (90, 26), end pos: (90, 45)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -87,7 +87,7 @@
         except Exception:
             raise ApiError(status_code=500, message="Internal server error")
-        return created if created is not None else account
+        return created if not created is not None else account
     def validate_account(self, email: str, password: str, fname: str, lname: str):
         """Validates created account information
Initializing DBUtility...
Initializing DBUtility...

52 : Job ID b806f45a5ce1441896007c0a5cd01931
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (120, 11), end pos: (120, 40)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -117,7 +117,7 @@
     def validate_email(self, email: str):
         domain = email.split("@")[-1]
-        if domain not in ALLOWED_DOMAINS:
+        if not domain not in ALLOWED_DOMAINS:
             raise ValidationError(
                 "Email must be a valid University of Manitoba email address "
                 "(@umanitoba.ca / @myumanitoba.ca)"
Initializing DBUtility...
Initializing DBUtility...

53 : Job ID a34e2b3b11f544248929188e990645e1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (127, 11), end pos: (127, 53)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -124,7 +124,7 @@
             )
     def validate_password(self, password: str):
-        if not re.fullmatch(PASSWORD_REGEX, password):
+        if not not re.fullmatch(PASSWORD_REGEX, password):
             raise ValidationError(
                 "Password must be at least 8 characters long and include "
                 "1 uppercase, 1 lowercase, 1 number, and no spaces."
Initializing DBUtility...
Initializing DBUtility...
