1 : Job ID dcfcee072d104314b054d2fceade3008
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_Add, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility + None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

2 : Job ID 2b882bae621943c895ff20fbcc282644
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_Sub, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility - None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

3 : Job ID 1f5907b7312c4b97a21a1fc2e97374ea
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_Mul, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility * None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

4 : Job ID dff94fbf696643e2843a9fb0754cf249
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_Div, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility / None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

5 : Job ID 10f2f99a4eef43c59c04aa17af0f1575
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_FloorDiv, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility // None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

6 : Job ID ed5affc9e9104c908b74525203ff3cbe
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_Mod, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility % None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

7 : Job ID 79f02d7cdf5f4780b2c0aea0c2bb5c40
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_Pow, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility ** None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

8 : Job ID ef9f6aab6a054da988e2031f9c961aa7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_RShift, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility >> None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

9 : Job ID 8d35dd9e1b75494b8db75daca9aee0e2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_LShift, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility << None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

10 : Job ID 9c1fd052edf14597a275fac811b26adb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_BitAnd, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility & None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

11 : Job ID 3c2bb86121464282b3651d73d44131f8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (43, 43), end pos: (43, 44)
operator: core/ReplaceBinaryOperator_BitOr_BitXor, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -40,7 +40,7 @@
     @staticmethod
     def from_domain(
         listing: Listing,
-        media_storage: MediaStorageUtility | None = None,
+        media_storage: MediaStorageUtility ^ None = None,
     ) -> "ListingResponse":
         image_url = listing.image_url

12 : Job ID 9a5a9dbb291e44ae9ae365559d5e62c7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (47, 39), end pos: (47, 45)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -44,7 +44,7 @@
     ) -> "ListingResponse":
         image_url = listing.image_url
-        if image_url and media_storage is not None:
+        if image_url and media_storage is None:
             image_url = media_storage.public_url(image_url)
         return ListingResponse(
Initializing DBUtility...
Initializing DBUtility...

13 : Job ID 93a461f74d1f4e3589660224bb2c3333
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (47, 11), end pos: (47, 50)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -44,7 +44,7 @@
     ) -> "ListingResponse":
         image_url = listing.image_url
-        if image_url and media_storage is not None:
+        if not image_url and media_storage is not None:
             image_url = media_storage.public_url(image_url)
         return ListingResponse(
Initializing DBUtility...
Initializing DBUtility...

14 : Job ID 3ba65343990040ccbe891821d0638a6b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (58, 57), end pos: (58, 75)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -55,6 +55,6 @@
             price=listing.price,
             image_url=image_url,
             location=listing.location,
-            created_at=listing.created_at.isoformat() if listing.created_at else None,
+            created_at=listing.created_at.isoformat() if not listing.created_at else None,
             is_sold=listing.is_sold,
         )
Initializing DBUtility...
Initializing DBUtility...

15 : Job ID 25530a695a614cf88bd5f2df29b59b2d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (47, 21), end pos: (47, 24)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -44,7 +44,7 @@
     ) -> "ListingResponse":
         image_url = listing.image_url
-        if image_url and media_storage is not None:
+        if image_url or media_storage is not None:
             image_url = media_storage.public_url(image_url)
         return ListingResponse(
Initializing DBUtility...
Initializing DBUtility...

16 : Job ID 536fc550c4434093b121ab49b8426a5a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (12, 33), end pos: (12, 34)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -9,7 +9,7 @@
     title: str
     description: str
-    price: float = Field(..., gt=0, le=99_999_999.99)
+    price: float = Field(..., gt= 1, le=99_999_999.99)
     image_url: str | None = None
     location: str | None = Field(default=None, max_length=120)
Initializing DBUtility...
Initializing DBUtility...

17 : Job ID e3aa31f7cf9b400da4ef6adda0404bf8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (12, 33), end pos: (12, 34)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -9,7 +9,7 @@
     title: str
     description: str
-    price: float = Field(..., gt=0, le=99_999_999.99)
+    price: float = Field(..., gt= -1, le=99_999_999.99)
     image_url: str | None = None
     location: str | None = Field(default=None, max_length=120)
Initializing DBUtility...
Initializing DBUtility...

18 : Job ID aaaf149f673442eb95a7bfdb6659b5db
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (12, 39), end pos: (12, 52)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -9,7 +9,7 @@
     title: str
     description: str
-    price: float = Field(..., gt=0, le=99_999_999.99)
+    price: float = Field(..., gt=0, le= 100000000.99)
     image_url: str | None = None
     location: str | None = Field(default=None, max_length=120)
Initializing DBUtility...
Initializing DBUtility...

19 : Job ID 416a0578e87746068d8b9851abd5292e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (12, 39), end pos: (12, 52)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -9,7 +9,7 @@
     title: str
     description: str
-    price: float = Field(..., gt=0, le=99_999_999.99)
+    price: float = Field(..., gt=0, le= 99999998.99)
     image_url: str | None = None
     location: str | None = Field(default=None, max_length=120)
Initializing DBUtility...
Initializing DBUtility...

20 : Job ID 900b3112d86c4d46bfb599ab13159b15
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (14, 58), end pos: (14, 61)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -11,7 +11,7 @@
     description: str
     price: float = Field(..., gt=0, le=99_999_999.99)
     image_url: str | None = None
-    location: str | None = Field(default=None, max_length=120)
+    location: str | None = Field(default=None, max_length= 121)
     def to_domain(self, seller_id: int) -> Listing:
         return Listing(
Initializing DBUtility...
Initializing DBUtility...

21 : Job ID f7d7cb01f84948c198a591b25b06ea48
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/listing_converter.py, start pos: (14, 58), end pos: (14, 61)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- asrc/api/converter/listing_converter.py
+++ bsrc/api/converter/listing_converter.py
@@ -11,7 +11,7 @@
     description: str
     price: float = Field(..., gt=0, le=99_999_999.99)
     image_url: str | None = None
-    location: str | None = Field(default=None, max_length=120)
+    location: str | None = Field(default=None, max_length= 119)
     def to_domain(self, seller_id: int) -> Listing:
         return Listing(
Initializing DBUtility...
Initializing DBUtility...

30 : Job ID abb4348d328b42188ea88e04a1f7c939
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (228, 29), end pos: (228, 31)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -225,7 +225,7 @@
                 details={"listing_id": None},
             )
-        if listing.seller_id != actor_id:
+        if listing.seller_id == actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller can mark this listing as sold.",
                 details={
Initializing DBUtility...
Initializing DBUtility...

31 : Job ID bfed025f8bf548f496e2807b91e7d1b1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (228, 29), end pos: (228, 31)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -225,7 +225,7 @@
                 details={"listing_id": None},
             )
-        if listing.seller_id != actor_id:
+        if listing.seller_id < actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller can mark this listing as sold.",
                 details={
Initializing DBUtility...
Initializing DBUtility...

32 : Job ID 2e88d8b6bb4342aaa3bd91135adccd9c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (228, 29), end pos: (228, 31)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -225,7 +225,7 @@
                 details={"listing_id": None},
             )
-        if listing.seller_id != actor_id:
+        if listing.seller_id <= actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller can mark this listing as sold.",
                 details={
Initializing DBUtility...
Initializing DBUtility...

33 : Job ID ddde66aeb685434381ce3c55d79688f5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (228, 29), end pos: (228, 31)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -225,7 +225,7 @@
                 details={"listing_id": None},
             )
-        if listing.seller_id != actor_id:
+        if listing.seller_id > actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller can mark this listing as sold.",
                 details={
Initializing DBUtility...
Initializing DBUtility...

34 : Job ID 0b491430b9e94af4a3eb88180f3600de
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (228, 29), end pos: (228, 31)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -225,7 +225,7 @@
                 details={"listing_id": None},
             )
-        if listing.seller_id != actor_id:
+        if listing.seller_id >= actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller can mark this listing as sold.",
                 details={
Initializing DBUtility...
Initializing DBUtility...

35 : Job ID 3874c17ae23a4f08b52b3670849fdb29
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (228, 29), end pos: (228, 31)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -225,7 +225,7 @@
                 details={"listing_id": None},
             )
-        if listing.seller_id != actor_id:
+        if listing.seller_id is actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller can mark this listing as sold.",
                 details={
Initializing DBUtility...
Initializing DBUtility...

36 : Job ID fb752401ae0a413c8467efa9df64da8d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (228, 29), end pos: (228, 31)
operator: core/ReplaceComparisonOperator_NotEq_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -225,7 +225,7 @@
                 details={"listing_id": None},
             )
-        if listing.seller_id != actor_id:
+        if listing.seller_id is not actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller can mark this listing as sold.",
                 details={
Initializing DBUtility...
Initializing DBUtility...

37 : Job ID 84c57a4d3fa246a7a10a12ff30b0820a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (128, 19), end pos: (128, 21)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -125,7 +125,7 @@
         listing_id = Validation.require_int(listing_id, "listing_id")
         listing = self._listing_db.get_by_id(listing_id)
-        if listing is None:
+        if listing is not None:
             return None
         comments = self._comment_db.get_by_listing_id(listing_id)
Initializing DBUtility...
Initializing DBUtility...

38 : Job ID f37ecf606655485c9ecf53ce9d27ccbd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (146, 27), end pos: (146, 29)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -143,7 +143,7 @@
         """
         Validation.require_not_none(listing, "listing")
-        if self._rating_db is None:
+        if self._rating_db is not None:
             raise ConfigurationError(
                 message="RatingDB dependency is required for fill_listing_rating_value().",
                 details={"missing_dependency": "BaseRatingDB"},
Initializing DBUtility...
Initializing DBUtility...

39 : Job ID eeef55765a2c4024987ed9fe43b896aa
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (152, 22), end pos: (152, 24)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -149,7 +149,7 @@
                 details={"missing_dependency": "BaseRatingDB"},
             )
-        if listing.id is None:
+        if listing.id is not None:
             return listing
         listing.rating = self._rating_db.get_by_listing_id(listing.id)
Initializing DBUtility...
Initializing DBUtility...

40 : Job ID b7a58c804c75483783d803354941ee7b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (168, 27), end pos: (168, 29)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -165,7 +165,7 @@
         """
         listing_id = Validation.require_int(listing_id, "listing_id")
-        if self._rating_db is None:
+        if self._rating_db is not None:
             raise ConfigurationError(
                 message="RatingDB dependency is required for get_listing_with_rating_by_id().",
                 details={"missing_dependency": "BaseRatingDB"},
Initializing DBUtility...
Initializing DBUtility...

44 : Job ID 01dbac1e6c854775bdcbbd0c3676f1e8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (222, 22), end pos: (222, 24)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 7
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -219,7 +219,7 @@
         actor_id = Validation.require_int(actor.id, "actor.id")
         buyer_id = Validation.require_int(buyer.id, "buyer.id")
-        if listing.id is None:
+        if listing.id is not None:
             raise ListingNotFoundError(
                 message="Listing must be persisted before being marked as sold.",
                 details={"listing_id": None},
Initializing DBUtility...
Initializing DBUtility...

45 : Job ID d2edc77fb1d04689aa0384b2db1c9ec9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (286, 19), end pos: (286, 21)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 8
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -283,7 +283,7 @@
         - If listing is not persisted -> return listing unchanged
         - If listing has no rating -> keep listing.rating as None
         """
-        if listing is None:
+        if listing is not None:
             return None
         if self._rating_db is None:
Initializing DBUtility...
Initializing DBUtility...

46 : Job ID 3c826469af1042e7ba324fae7d9eaee6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (289, 27), end pos: (289, 29)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 9
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -286,7 +286,7 @@
         if listing is None:
             return None
-        if self._rating_db is None:
+        if self._rating_db is not None:
             return listing
         if listing.id is None:
Initializing DBUtility...
Initializing DBUtility...

47 : Job ID 5c950b4f935b416f8bd52728369b48fa
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (292, 22), end pos: (292, 24)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 10
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -289,7 +289,7 @@
         if self._rating_db is None:
             return listing
-        if listing.id is None:
+        if listing.id is not None:
             return listing
         listing.rating = self._rating_db.get_by_listing_id(listing.id)
Initializing DBUtility...
Initializing DBUtility...

48 : Job ID bc676fdb2d964150ac93396bad28dbd4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (299, 27), end pos: (299, 29)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 11
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -296,7 +296,7 @@
         return listing
     def _populate_ratings_if_available(self, listings: List[Listing]) -> List[Listing]:
-        if self._rating_db is None:
+        if self._rating_db is not None:
             return listings
         for listing in listings:
Initializing DBUtility...
Initializing DBUtility...

49 : Job ID 6b13e97e7a2847d396605f87e0ee9283
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (128, 11), end pos: (128, 26)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -125,7 +125,7 @@
         listing_id = Validation.require_int(listing_id, "listing_id")
         listing = self._listing_db.get_by_id(listing_id)
-        if listing is None:
+        if not listing is None:
             return None
         comments = self._comment_db.get_by_listing_id(listing_id)
Initializing DBUtility...
Initializing DBUtility...

50 : Job ID 4640726962d945bcbe60048fff462ebc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (146, 11), end pos: (146, 34)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -143,7 +143,7 @@
         """
         Validation.require_not_none(listing, "listing")
-        if self._rating_db is None:
+        if not self._rating_db is None:
             raise ConfigurationError(
                 message="RatingDB dependency is required for fill_listing_rating_value().",
                 details={"missing_dependency": "BaseRatingDB"},
Initializing DBUtility...
Initializing DBUtility...

51 : Job ID b7ad3ee67b89456f983d49a088d1ab93
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (152, 11), end pos: (152, 29)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -149,7 +149,7 @@
                 details={"missing_dependency": "BaseRatingDB"},
             )
-        if listing.id is None:
+        if not listing.id is None:
             return listing
         listing.rating = self._rating_db.get_by_listing_id(listing.id)
Initializing DBUtility...
Initializing DBUtility...

52 : Job ID 1c1cb24a54db4574a8e65035fca9e7ae
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (168, 11), end pos: (168, 34)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -165,7 +165,7 @@
         """
         listing_id = Validation.require_int(listing_id, "listing_id")
-        if self._rating_db is None:
+        if not self._rating_db is None:
             raise ConfigurationError(
                 message="RatingDB dependency is required for get_listing_with_rating_by_id().",
                 details={"missing_dependency": "BaseRatingDB"},
Initializing DBUtility...
Initializing DBUtility...
