56 : Job ID 68647f28671b4f59adac9c01d9d3cf13
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (222, 11), end pos: (222, 29)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -219,7 +219,7 @@
         actor_id = Validation.require_int(actor.id, "actor.id")
         buyer_id = Validation.require_int(buyer.id, "buyer.id")
-        if listing.id is None:
+        if not listing.id is None:
             raise ListingNotFoundError(
                 message="Listing must be persisted before being marked as sold.",
                 details={"listing_id": None},
Initializing DBUtility...
Initializing DBUtility...

57 : Job ID eea450d0c1784f17b5aee0ce6486eec5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (228, 11), end pos: (228, 40)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -225,7 +225,7 @@
                 details={"listing_id": None},
             )
-        if listing.seller_id != actor_id:
+        if not listing.seller_id != actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller can mark this listing as sold.",
                 details={
Initializing DBUtility...
Initializing DBUtility...

59 : Job ID 0691f5b508634724b7845234a2842baa
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (244, 11), end pos: (244, 26)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -241,7 +241,7 @@
                 details={"listing_id": listing.id},
             )
-        if listing.is_sold:
+        if not listing.is_sold:
             raise UnapprovedBehaviorError(
                 message="Listing is already sold.",
                 details={"listing_id": listing.id},
Initializing DBUtility...
Initializing DBUtility...

60 : Job ID c9fa89dd63cf4d5e8fe82fff4e2edf4c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (286, 11), end pos: (286, 26)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -283,7 +283,7 @@
         - If listing is not persisted -> return listing unchanged
         - If listing has no rating -> keep listing.rating as None
         """
-        if listing is None:
+        if not listing is None:
             return None
         if self._rating_db is None:
Initializing DBUtility...
Initializing DBUtility...

61 : Job ID 83ce411478214ab1bd488dac4118220c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (289, 11), end pos: (289, 34)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -286,7 +286,7 @@
         if listing is None:
             return None
-        if self._rating_db is None:
+        if not self._rating_db is None:
             return listing
         if listing.id is None:
Initializing DBUtility...
Initializing DBUtility...

62 : Job ID 7758d07797d94d4194f6c53174d3a50d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (292, 11), end pos: (292, 29)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -289,7 +289,7 @@
         if self._rating_db is None:
             return listing
-        if listing.id is None:
+        if not listing.id is None:
             return listing
         listing.rating = self._rating_db.get_by_listing_id(listing.id)
Initializing DBUtility...
Initializing DBUtility...

63 : Job ID 4d3de6470f3b4aa38137896550c61ccb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (299, 11), end pos: (299, 34)
operator: core/AddNot, occurrence: 14
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -296,7 +296,7 @@
         return listing
     def _populate_ratings_if_available(self, listings: List[Listing]) -> List[Listing]:
-        if self._rating_db is None:
+        if not self._rating_db is None:
             return listings
         for listing in listings:
Initializing DBUtility...
Initializing DBUtility...

64 : Job ID 541130c8b370441296b1fbc7d67f6ddb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (254, 20), end pos: (254, 24)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -251,7 +251,7 @@
         self._listing_db.set_sold(
             listing_id=listing.id,
-            is_sold=True,
+            is_sold=False,
             sold_to_id=buyer_id,
         )
Initializing DBUtility...
Initializing DBUtility...

65 : Job ID cde94ce1b9c74763bddf4606bb4ed2ad
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (68, 46), end pos: (68, 48)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -65,7 +65,7 @@
         return self._populate_ratings_if_available(listings)
     @override # pragma: no mutate
-    def list_recent_unsold(self, limit: int = 50, offset: int = 0) -> List[Listing]:
+    def list_recent_unsold(self, limit: int = 51, offset: int = 0) -> List[Listing]:
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
         listings = self._listing_db.get_recent_unsold(limit=limit, offset=offset)
Initializing DBUtility...
Initializing DBUtility...

66 : Job ID 6401e05ea2cb46a88e346cc834343f31
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (68, 46), end pos: (68, 48)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -65,7 +65,7 @@
         return self._populate_ratings_if_available(listings)
     @override # pragma: no mutate
-    def list_recent_unsold(self, limit: int = 50, offset: int = 0) -> List[Listing]:
+    def list_recent_unsold(self, limit: int = 49, offset: int = 0) -> List[Listing]:
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
         listings = self._listing_db.get_recent_unsold(limit=limit, offset=offset)
Initializing DBUtility...
Initializing DBUtility...

67 : Job ID 04f285ecbe9a4b9b8f5eba77ffa11c7f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (68, 64), end pos: (68, 65)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -65,7 +65,7 @@
         return self._populate_ratings_if_available(listings)
     @override # pragma: no mutate
-    def list_recent_unsold(self, limit: int = 50, offset: int = 0) -> List[Listing]:
+    def list_recent_unsold(self, limit: int = 50, offset: int = 1) -> List[Listing]:
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
         listings = self._listing_db.get_recent_unsold(limit=limit, offset=offset)
Initializing DBUtility...
Initializing DBUtility...

68 : Job ID f9367c27e6be474e827c8c70e633d5e0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (68, 64), end pos: (68, 65)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -65,7 +65,7 @@
         return self._populate_ratings_if_available(listings)
     @override # pragma: no mutate
-    def list_recent_unsold(self, limit: int = 50, offset: int = 0) -> List[Listing]:
+    def list_recent_unsold(self, limit: int = 50, offset: int = -1) -> List[Listing]:
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
         listings = self._listing_db.get_recent_unsold(limit=limit, offset=offset)
Initializing DBUtility...
Initializing DBUtility...

69 : Job ID e6c21b2ec40f4b418783155cd164df64
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (94, 70), end pos: (94, 72)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -91,7 +91,7 @@
         return self._populate_ratings_if_available(listings)
     @override # pragma: no mutate
-    def find_unsold_by_title_keyword(self, keyword: str, limit: int = 50, offset: int = 0) -> List[Listing]:
+    def find_unsold_by_title_keyword(self, keyword: str, limit: int = 51, offset: int = 0) -> List[Listing]:
         keyword = Validation.require_str(keyword, "keyword")
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
Initializing DBUtility...
Initializing DBUtility...

70 : Job ID 7c82b3df11bf4e03b4d5eb1ff2530acc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (94, 70), end pos: (94, 72)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -91,7 +91,7 @@
         return self._populate_ratings_if_available(listings)
     @override # pragma: no mutate
-    def find_unsold_by_title_keyword(self, keyword: str, limit: int = 50, offset: int = 0) -> List[Listing]:
+    def find_unsold_by_title_keyword(self, keyword: str, limit: int = 49, offset: int = 0) -> List[Listing]:
         keyword = Validation.require_str(keyword, "keyword")
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
Initializing DBUtility...
Initializing DBUtility...

71 : Job ID 0ae051c89b514080b7ed4e8e2b824b70
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (94, 88), end pos: (94, 89)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -91,7 +91,7 @@
         return self._populate_ratings_if_available(listings)
     @override # pragma: no mutate
-    def find_unsold_by_title_keyword(self, keyword: str, limit: int = 50, offset: int = 0) -> List[Listing]:
+    def find_unsold_by_title_keyword(self, keyword: str, limit: int = 50, offset: int = 1) -> List[Listing]:
         keyword = Validation.require_str(keyword, "keyword")
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
Initializing DBUtility...
Initializing DBUtility...

72 : Job ID 92ff18d5cbde42b68c263246f7313837
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (94, 88), end pos: (94, 89)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -91,7 +91,7 @@
         return self._populate_ratings_if_available(listings)
     @override # pragma: no mutate
-    def find_unsold_by_title_keyword(self, keyword: str, limit: int = 50, offset: int = 0) -> List[Listing]:
+    def find_unsold_by_title_keyword(self, keyword: str, limit: int = 50, offset: int = -1) -> List[Listing]:
         keyword = Validation.require_str(keyword, "keyword")
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
Initializing DBUtility...
Initializing DBUtility...

92 : Job ID ebd0801d1d224b4db6ceb3571127d1a1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/listing/listing_manager.py, start pos: (302, 23), end pos: (302, 31)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/listing/listing_manager.py
+++ bsrc/business_logic/managers/listing/listing_manager.py
@@ -299,7 +299,7 @@
         if self._rating_db is None:
             return listings
-        for listing in listings:
+        for listing in []:
             self._populate_rating_if_available(listing)
         return listings
Initializing DBUtility...
Initializing DBUtility...
