54 : Job ID 893df628303a447c9860b7bf1928b4d4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (183, 11), end pos: (183, 20)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -180,7 +180,7 @@
             TokenAlreadyUsedError: If auth_token was already used
             AccountNotFoundError: If account not found
         """
-        if not token:
+        if not not token:
             raise EmailVerificationError(
                 message="Token cannot be empty", details={"auth_token": token}
             )
Initializing DBUtility...
Initializing DBUtility...

55 : Job ID 446c219eefa14233afe78fe566790190
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (194, 11), end pos: (194, 27)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -191,7 +191,7 @@
         # Try to find the auth_token in database
         db_token = self.token_db.get_by_hash(token_hash)
-        if db_token is None:
+        if not db_token is None:
             raise TokenNotFoundError(
                 message="Invalid or expired verification auth_token",
                 details={"token_hash": token_hash},
Initializing DBUtility...
Initializing DBUtility...

56 : Job ID 6f70cc743d1a480fa0214510574fbd26
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (201, 11), end pos: (201, 24)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -198,7 +198,7 @@
             )
         # Check if auth_token has been used already
-        if db_token.used:
+        if not db_token.used:
             raise TokenAlreadyUsedError(
                 message="This verification auth_token has already been used",
                 details={"token_id": db_token.id},
Initializing DBUtility...
Initializing DBUtility...

57 : Job ID 4a07aa9795ec4b22b7a9b7ac2b2b9a2f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (208, 11), end pos: (208, 32)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -205,7 +205,7 @@
             )
         # Check if auth_token has expired
-        if db_token.is_expired():
+        if not db_token.is_expired():
             raise TokenExpiredError(
                 message="This verification auth_token has expired",
                 details={
Initializing DBUtility...
Initializing DBUtility...

58 : Job ID 62673612f47a4b5cb38f580f4e09a8e5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (242, 11), end pos: (242, 20)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -239,7 +239,7 @@
         Raises:
             ApiError: If account not found.
         """
-        if not email:
+        if not not email:
             raise ApiError(status_code=400, message="Email cannot be empty")
         account = self.account_manager.get_account_by_email(email)
Initializing DBUtility...
Initializing DBUtility...

59 : Job ID 1cfb42dad40141ea8d2fab9320fe6bc7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (247, 11), end pos: (247, 26)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -244,7 +244,7 @@
         account = self.account_manager.get_account_by_email(email)
-        if account is None:
+        if not account is None:
             raise ApiError(
                 status_code=404, message=f"Account not found for email: {email}"
             )
Initializing DBUtility...
Initializing DBUtility...

60 : Job ID b3b7f73bce624a8eba18f17cc4f82d0c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (265, 11), end pos: (265, 36)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -262,7 +262,7 @@
             str: A JWT auth_token for the authenticated user.
         """
-        if not email or not password:
+        if not not email or not password:
             raise ApiError(status_code=400, message="Email and password are required")
         # Get account from database
Initializing DBUtility...
Initializing DBUtility...

62 : Job ID ebca7f168eff41efb0251a032b6ba2be
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (274, 11), end pos: (274, 39)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -271,7 +271,7 @@
         if account is None:
             raise ApiError(status_code=401, message="Invalid email or password")
-        if account.password != password:
+        if not account.password != password:
             raise ApiError(status_code=401, message="Invalid email or password")
         # for when we implement password hashing
Initializing DBUtility...
Initializing DBUtility...

63 : Job ID f8cf2fb05d114498a609272b9f327267
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (289, 11), end pos: (289, 25)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -286,7 +286,7 @@
         return token
     def get_account_by_userid(self, userid: int) -> Account:
-        if userid is None:
+        if not userid is None:
             raise ApiError(status_code=400, message="User ID cannot be None")
         account = self.account_manager.get_account_by_id(userid)
Initializing DBUtility...
Initializing DBUtility...

64 : Job ID 90a3fd52a9f9422bba3bc00144af31e3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (294, 11), end pos: (294, 26)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -291,7 +291,7 @@
         account = self.account_manager.get_account_by_id(userid)
-        if account is None:
+        if not account is None:
             raise ApiError(status_code=404, message="Account not found")
         account.rating_count = self.rating_manager.count_ratings_received_by_account_id(
Initializing DBUtility...
Initializing DBUtility...

65 : Job ID 873f0c6d01e648e380f99a78bac02cab
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (222, 27), end pos: (222, 31)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -219,7 +219,7 @@
         # TODO: Call DAO to update account.verified = true
         # For now, we'll return the account (real implementation will update DB)
-        account.verified = True
+        account.verified = False
         # Mark auth_token as used ONLY after successful verification
         self.token_db.mark_used(db_token.id)
Initializing DBUtility...
Initializing DBUtility...

66 : Job ID 4b73431bd263437e9be6187958d2ce15
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (265, 21), end pos: (265, 23)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -262,7 +262,7 @@
             str: A JWT auth_token for the authenticated user.
         """
-        if not email or not password:
+        if not email and not password:
             raise ApiError(status_code=400, message="Email and password are required")
         # Get account from database
Initializing DBUtility...
Initializing DBUtility...

67 : Job ID 117973e24a9642e4acb2fdb8427091e4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (78, 15), end pos: (78, 40)
operator: core/ExceptionReplacer, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -75,7 +75,7 @@
         try:
             created = self.account_manager.create_account(account)
-        except AccountAlreadyExistsError as e:
+        except CosmicRayTestingException as e:
             raise AccountAlreadyExistsError(status_code=409, message=str(e))
         except ValidationError as e:
Initializing DBUtility...
Initializing DBUtility...

68 : Job ID d7f0624f8f254d60b5db0a090c33d093
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (81, 15), end pos: (81, 30)
operator: core/ExceptionReplacer, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -78,7 +78,7 @@
         except AccountAlreadyExistsError as e:
             raise AccountAlreadyExistsError(status_code=409, message=str(e))
-        except ValidationError as e:
+        except CosmicRayTestingException as e:
             raise ApiError(status_code=422, message=str(e))
         except DatabaseUnavailableError as e:
Initializing DBUtility...
Initializing DBUtility...

69 : Job ID f1495d0bf8804b828c21d9c8f4971fe7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (84, 15), end pos: (84, 39)
operator: core/ExceptionReplacer, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -81,7 +81,7 @@
         except ValidationError as e:
             raise ApiError(status_code=422, message=str(e))
-        except DatabaseUnavailableError as e:
+        except CosmicRayTestingException as e:
             raise ApiError(status_code=503, message=str(e))
         except Exception:
Initializing DBUtility...
Initializing DBUtility...

70 : Job ID f45bf8df253c498aa36b2eae5b751db0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (87, 15), end pos: (87, 24)
operator: core/ExceptionReplacer, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -84,7 +84,7 @@
         except DatabaseUnavailableError as e:
             raise ApiError(status_code=503, message=str(e))
-        except Exception:
+        except CosmicRayTestingException:
             raise ApiError(status_code=500, message="Internal server error")
         return created if created is not None else account
Initializing DBUtility...
Initializing DBUtility...

71 : Job ID 709381da46ae4132b74dc61a8aade61c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (79, 56), end pos: (79, 59)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -76,7 +76,7 @@
         try:
             created = self.account_manager.create_account(account)
         except AccountAlreadyExistsError as e:
-            raise AccountAlreadyExistsError(status_code=409, message=str(e))
+            raise AccountAlreadyExistsError(status_code= 410, message=str(e))
         except ValidationError as e:
             raise ApiError(status_code=422, message=str(e))
Initializing DBUtility...
Initializing DBUtility...

72 : Job ID 198bb4b0d88f44ffb36a63b5c4ea9281
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (79, 56), end pos: (79, 59)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -76,7 +76,7 @@
         try:
             created = self.account_manager.create_account(account)
         except AccountAlreadyExistsError as e:
-            raise AccountAlreadyExistsError(status_code=409, message=str(e))
+            raise AccountAlreadyExistsError(status_code= 408, message=str(e))
         except ValidationError as e:
             raise ApiError(status_code=422, message=str(e))
Initializing DBUtility...
Initializing DBUtility...

73 : Job ID 00f81324b7c54314a816f9507c6a0b63
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (82, 39), end pos: (82, 42)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -79,7 +79,7 @@
             raise AccountAlreadyExistsError(status_code=409, message=str(e))
         except ValidationError as e:
-            raise ApiError(status_code=422, message=str(e))
+            raise ApiError(status_code= 423, message=str(e))
         except DatabaseUnavailableError as e:
             raise ApiError(status_code=503, message=str(e))
Initializing DBUtility...
Initializing DBUtility...

74 : Job ID d45090139b834921b1b5b747f1e67c87
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (82, 39), end pos: (82, 42)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -79,7 +79,7 @@
             raise AccountAlreadyExistsError(status_code=409, message=str(e))
         except ValidationError as e:
-            raise ApiError(status_code=422, message=str(e))
+            raise ApiError(status_code= 421, message=str(e))
         except DatabaseUnavailableError as e:
             raise ApiError(status_code=503, message=str(e))
Initializing DBUtility...
Initializing DBUtility...

75 : Job ID b93f92dcb83649768487fe6749c08493
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (85, 39), end pos: (85, 42)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -82,7 +82,7 @@
             raise ApiError(status_code=422, message=str(e))
         except DatabaseUnavailableError as e:
-            raise ApiError(status_code=503, message=str(e))
+            raise ApiError(status_code= 504, message=str(e))
         except Exception:
             raise ApiError(status_code=500, message="Internal server error")
Initializing DBUtility...
Initializing DBUtility...

76 : Job ID 624ab0aa6e01490d85d7ed92b1fafb92
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (85, 39), end pos: (85, 42)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -82,7 +82,7 @@
             raise ApiError(status_code=422, message=str(e))
         except DatabaseUnavailableError as e:
-            raise ApiError(status_code=503, message=str(e))
+            raise ApiError(status_code= 502, message=str(e))
         except Exception:
             raise ApiError(status_code=500, message="Internal server error")
Initializing DBUtility...
Initializing DBUtility...

77 : Job ID 7ed8de907a5147668672eaf264e1ec5b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (88, 39), end pos: (88, 42)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -85,7 +85,7 @@
             raise ApiError(status_code=503, message=str(e))
         except Exception:
-            raise ApiError(status_code=500, message="Internal server error")
+            raise ApiError(status_code= 501, message="Internal server error")
         return created if created is not None else account
Initializing DBUtility...
Initializing DBUtility...

78 : Job ID a065415d6eef4e8fa67966acbfb15c5c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (88, 39), end pos: (88, 42)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -85,7 +85,7 @@
             raise ApiError(status_code=503, message=str(e))
         except Exception:
-            raise ApiError(status_code=500, message="Internal server error")
+            raise ApiError(status_code= 499, message="Internal server error")
         return created if created is not None else account
Initializing DBUtility...
Initializing DBUtility...

79 : Job ID c12ca819376046d8859f3d37d9304a6c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (119, 35), end pos: (119, 36)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -116,7 +116,7 @@
         return email, password, fname, lname
     def validate_email(self, email: str):
-        domain = email.split("@")[-1]
+        domain = email.split("@")[- 2]
         if domain not in ALLOWED_DOMAINS:
             raise ValidationError(
                 "Email must be a valid University of Manitoba email address "
Initializing DBUtility...
Initializing DBUtility...

80 : Job ID f600289f3fce4edc9dcdc2e2536937d3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (119, 35), end pos: (119, 36)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -116,7 +116,7 @@
         return email, password, fname, lname
     def validate_email(self, email: str):
-        domain = email.split("@")[-1]
+        domain = email.split("@")[- 0]
         if domain not in ALLOWED_DOMAINS:
             raise ValidationError(
                 "Email must be a valid University of Manitoba email address "
Initializing DBUtility...
Initializing DBUtility...

81 : Job ID 71006d0e1b274d728f94c11a9b05870f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (243, 39), end pos: (243, 42)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -240,7 +240,7 @@
             ApiError: If account not found.
         """
         if not email:
-            raise ApiError(status_code=400, message="Email cannot be empty")
+            raise ApiError(status_code= 401, message="Email cannot be empty")
         account = self.account_manager.get_account_by_email(email)
Initializing DBUtility...
Initializing DBUtility...

82 : Job ID d485ab39c5ee4fd2b9e9a926ac9fffd4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (243, 39), end pos: (243, 42)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -240,7 +240,7 @@
             ApiError: If account not found.
         """
         if not email:
-            raise ApiError(status_code=400, message="Email cannot be empty")
+            raise ApiError(status_code= 399, message="Email cannot be empty")
         account = self.account_manager.get_account_by_email(email)
Initializing DBUtility...
Initializing DBUtility...

83 : Job ID 487e6f8e45ff4c20910b45da532cfd37
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (249, 28), end pos: (249, 31)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -246,7 +246,7 @@
         if account is None:
             raise ApiError(
-                status_code=404, message=f"Account not found for email: {email}"
+                status_code= 405, message=f"Account not found for email: {email}"
             )
         return account
Initializing DBUtility...
Initializing DBUtility...

84 : Job ID 6993c76cba1d4e0ea832f70b3989a475
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (249, 28), end pos: (249, 31)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -246,7 +246,7 @@
         if account is None:
             raise ApiError(
-                status_code=404, message=f"Account not found for email: {email}"
+                status_code= 403, message=f"Account not found for email: {email}"
             )
         return account
Initializing DBUtility...
Initializing DBUtility...

85 : Job ID 36cff26eed8343649ff593d42a73d804
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (266, 39), end pos: (266, 42)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -263,7 +263,7 @@
         """
         if not email or not password:
-            raise ApiError(status_code=400, message="Email and password are required")
+            raise ApiError(status_code= 401, message="Email and password are required")
         # Get account from database
         account = self.account_manager.get_account_by_email(email)
Initializing DBUtility...
Initializing DBUtility...

86 : Job ID c0b32fe297ba497f867e477b5bea0b7a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (266, 39), end pos: (266, 42)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -263,7 +263,7 @@
         """
         if not email or not password:
-            raise ApiError(status_code=400, message="Email and password are required")
+            raise ApiError(status_code= 399, message="Email and password are required")
         # Get account from database
         account = self.account_manager.get_account_by_email(email)
Initializing DBUtility...
Initializing DBUtility...

87 : Job ID 29e121c4868a4677bf13e60bf9c46ebf
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (272, 39), end pos: (272, 42)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -269,7 +269,7 @@
         account = self.account_manager.get_account_by_email(email)
         if account is None:
-            raise ApiError(status_code=401, message="Invalid email or password")
+            raise ApiError(status_code= 402, message="Invalid email or password")
         if account.password != password:
             raise ApiError(status_code=401, message="Invalid email or password")
Initializing DBUtility...
Initializing DBUtility...

88 : Job ID b741d3e1c98b441495749a876785c394
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (272, 39), end pos: (272, 42)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -269,7 +269,7 @@
         account = self.account_manager.get_account_by_email(email)
         if account is None:
-            raise ApiError(status_code=401, message="Invalid email or password")
+            raise ApiError(status_code= 400, message="Invalid email or password")
         if account.password != password:
             raise ApiError(status_code=401, message="Invalid email or password")
Initializing DBUtility...
Initializing DBUtility...

89 : Job ID b3c02b4844c44e31b08c3d1a4b315ea3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (275, 39), end pos: (275, 42)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -272,7 +272,7 @@
             raise ApiError(status_code=401, message="Invalid email or password")
         if account.password != password:
-            raise ApiError(status_code=401, message="Invalid email or password")
+            raise ApiError(status_code= 402, message="Invalid email or password")
         # for when we implement password hashing
         ## if not bcrypt.checkpw(password.encode(), account.password.encode()):
Initializing DBUtility...
Initializing DBUtility...

90 : Job ID a59adae5e4c5428f8cd8d8e7d26fea33
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (275, 39), end pos: (275, 42)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -272,7 +272,7 @@
             raise ApiError(status_code=401, message="Invalid email or password")
         if account.password != password:
-            raise ApiError(status_code=401, message="Invalid email or password")
+            raise ApiError(status_code= 400, message="Invalid email or password")
         # for when we implement password hashing
         ## if not bcrypt.checkpw(password.encode(), account.password.encode()):
Initializing DBUtility...
Initializing DBUtility...

93 : Job ID 2a2245c9d5cc477fa8340c215b6cc78c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (290, 39), end pos: (290, 42)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -287,7 +287,7 @@
     def get_account_by_userid(self, userid: int) -> Account:
         if userid is None:
-            raise ApiError(status_code=400, message="User ID cannot be None")
+            raise ApiError(status_code= 401, message="User ID cannot be None")
         account = self.account_manager.get_account_by_id(userid)
Initializing DBUtility...
Initializing DBUtility...

94 : Job ID 2d29bd7bd71f47a0a69996293dcaa2e8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (290, 39), end pos: (290, 42)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -287,7 +287,7 @@
     def get_account_by_userid(self, userid: int) -> Account:
         if userid is None:
-            raise ApiError(status_code=400, message="User ID cannot be None")
+            raise ApiError(status_code= 399, message="User ID cannot be None")
         account = self.account_manager.get_account_by_id(userid)
Initializing DBUtility...
Initializing DBUtility...

95 : Job ID f2b43df6bcdc4128a9e1767164daae55
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (295, 39), end pos: (295, 42)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -292,7 +292,7 @@
         account = self.account_manager.get_account_by_id(userid)
         if account is None:
-            raise ApiError(status_code=404, message="Account not found")
+            raise ApiError(status_code= 405, message="Account not found")
         account.rating_count = self.rating_manager.count_ratings_received_by_account_id(
             userid
Initializing DBUtility...
Initializing DBUtility...
