1 : Job ID ba5ae66b64444ce9bb34f9ef3fb41819
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (47, 29), end pos: (47, 31)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -44,7 +44,7 @@
                 message="Cannot send an offer on a closed listing."
             )
-        if listing.seller_id == offer.sender_id:
+        if listing.seller_id != offer.sender_id:
             raise UnapprovedBehaviorError(
                 message="You cannot send an offer on your own listing."
             )
Initializing DBUtility...
Initializing DBUtility...

2 : Job ID 5fc9aafd1da84272b86c26eca30806e4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (47, 29), end pos: (47, 31)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -44,7 +44,7 @@
                 message="Cannot send an offer on a closed listing."
             )
-        if listing.seller_id == offer.sender_id:
+        if listing.seller_id < offer.sender_id:
             raise UnapprovedBehaviorError(
                 message="You cannot send an offer on your own listing."
             )
Initializing DBUtility...
Initializing DBUtility...

3 : Job ID 1fba376f508d4073b46992483b3e71eb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (47, 29), end pos: (47, 31)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -44,7 +44,7 @@
                 message="Cannot send an offer on a closed listing."
             )
-        if listing.seller_id == offer.sender_id:
+        if listing.seller_id <= offer.sender_id:
             raise UnapprovedBehaviorError(
                 message="You cannot send an offer on your own listing."
             )
Initializing DBUtility...
Initializing DBUtility...

4 : Job ID b71e8e9642cb4442822760a9ff7d87f7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (47, 29), end pos: (47, 31)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -44,7 +44,7 @@
                 message="Cannot send an offer on a closed listing."
             )
-        if listing.seller_id == offer.sender_id:
+        if listing.seller_id > offer.sender_id:
             raise UnapprovedBehaviorError(
                 message="You cannot send an offer on your own listing."
             )
Initializing DBUtility...
Initializing DBUtility...

5 : Job ID 4f94e9582f7f410a85064f320a96e556
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (47, 29), end pos: (47, 31)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -44,7 +44,7 @@
                 message="Cannot send an offer on a closed listing."
             )
-        if listing.seller_id == offer.sender_id:
+        if listing.seller_id >= offer.sender_id:
             raise UnapprovedBehaviorError(
                 message="You cannot send an offer on your own listing."
             )
Initializing DBUtility...
Initializing DBUtility...

6 : Job ID 9839c446fdc04a01863c6617fda25e7c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (47, 29), end pos: (47, 31)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -44,7 +44,7 @@
                 message="Cannot send an offer on a closed listing."
             )
-        if listing.seller_id == offer.sender_id:
+        if listing.seller_id is offer.sender_id:
             raise UnapprovedBehaviorError(
                 message="You cannot send an offer on your own listing."
             )
Initializing DBUtility...
Initializing DBUtility...

7 : Job ID a6775c6d38b94d869410cb28cd343ead
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (47, 29), end pos: (47, 31)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -44,7 +44,7 @@
                 message="Cannot send an offer on a closed listing."
             )
-        if listing.seller_id == offer.sender_id:
+        if listing.seller_id is not offer.sender_id:
             raise UnapprovedBehaviorError(
                 message="You cannot send an offer on your own listing."
             )
Initializing DBUtility...
Initializing DBUtility...

8 : Job ID 18a6ed4721dc493d8eb39bcac7f20a92
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (163, 29), end pos: (163, 31)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -160,7 +160,7 @@
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.seller_id != actor_id:
+        if listing.seller_id == actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller of the listing can accept or decline offers."
             )
Initializing DBUtility...
Initializing DBUtility...

9 : Job ID ce930b7d5b234678928f2deccfe2d77e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (178, 28), end pos: (178, 30)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -175,7 +175,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
-                if other.id != offer_id:
+                if other.id == offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

10 : Job ID 1b982d80b72a4988aef4720b52fc3269
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (163, 29), end pos: (163, 31)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -160,7 +160,7 @@
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.seller_id != actor_id:
+        if listing.seller_id < actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller of the listing can accept or decline offers."
             )
Initializing DBUtility...
Initializing DBUtility...

11 : Job ID 9feafae58a594b53b2429c4422b90133
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (178, 28), end pos: (178, 30)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -175,7 +175,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
-                if other.id != offer_id:
+                if other.id < offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

12 : Job ID 749cb754bdac4a319010f4ebc1d4973b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (163, 29), end pos: (163, 31)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -160,7 +160,7 @@
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.seller_id != actor_id:
+        if listing.seller_id <= actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller of the listing can accept or decline offers."
             )
Initializing DBUtility...
Initializing DBUtility...

13 : Job ID 37c15b7a9d6148c6b15cde3ef7fa9e81
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (178, 28), end pos: (178, 30)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -175,7 +175,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
-                if other.id != offer_id:
+                if other.id <= offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

14 : Job ID e250dd4d50c246a1bd61bbeae1cd863f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (163, 29), end pos: (163, 31)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -160,7 +160,7 @@
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.seller_id != actor_id:
+        if listing.seller_id > actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller of the listing can accept or decline offers."
             )
Initializing DBUtility...
Initializing DBUtility...

15 : Job ID 687bcd165c724678b90466c81819b3fb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (178, 28), end pos: (178, 30)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -175,7 +175,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
-                if other.id != offer_id:
+                if other.id > offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

16 : Job ID f2fd694550c044949f77ca2d93870621
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (163, 29), end pos: (163, 31)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -160,7 +160,7 @@
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.seller_id != actor_id:
+        if listing.seller_id >= actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller of the listing can accept or decline offers."
             )
Initializing DBUtility...
Initializing DBUtility...

17 : Job ID 25b9b99ab9a04b0ea1aa190f727a167b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (178, 28), end pos: (178, 30)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -175,7 +175,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
-                if other.id != offer_id:
+                if other.id >= offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

18 : Job ID 36fc5a992e7f49c5bf39c880051c9f64
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (163, 29), end pos: (163, 31)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -160,7 +160,7 @@
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.seller_id != actor_id:
+        if listing.seller_id is actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller of the listing can accept or decline offers."
             )
Initializing DBUtility...
Initializing DBUtility...

19 : Job ID 6066408051e04bfc929e5da3e154b812
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (178, 28), end pos: (178, 30)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -175,7 +175,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
-                if other.id != offer_id:
+                if other.id is offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

20 : Job ID 9ec554f69c1b4019879c037e9f928f68
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (163, 29), end pos: (163, 31)
operator: core/ReplaceComparisonOperator_NotEq_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -160,7 +160,7 @@
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.seller_id != actor_id:
+        if listing.seller_id is not actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller of the listing can accept or decline offers."
             )
Initializing DBUtility...
Initializing DBUtility...

21 : Job ID 85beecb37909471f9ae1e6644b625a9d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (178, 28), end pos: (178, 30)
operator: core/ReplaceComparisonOperator_NotEq_IsNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -175,7 +175,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
-                if other.id != offer_id:
+                if other.id is not offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

22 : Job ID 454486c175cb4a168ac0e360d49372e3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 33), end pos: (61, 35)
operator: core/ReplaceComparisonOperator_Is_Eq, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if existing.accepted == True:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

23 : Job ID bbd9cf24b996489f88910999b415e1bd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 33), end pos: (61, 35)
operator: core/ReplaceComparisonOperator_Is_NotEq, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if existing.accepted != True:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

24 : Job ID 2820b0c30707477bb36cdc90e1ffbdfc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 33), end pos: (61, 35)
operator: core/ReplaceComparisonOperator_Is_Lt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if existing.accepted < True:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

25 : Job ID 7dc24c308e464bbabd88cf4c896e3a8d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 33), end pos: (61, 35)
operator: core/ReplaceComparisonOperator_Is_LtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if existing.accepted <= True:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

26 : Job ID 841f990f5a0142069ab821c77884d382
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 33), end pos: (61, 35)
operator: core/ReplaceComparisonOperator_Is_Gt, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if existing.accepted > True:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

27 : Job ID 45ad9357034f4971b224f6c0c007a58b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 33), end pos: (61, 35)
operator: core/ReplaceComparisonOperator_Is_GtE, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if existing.accepted >= True:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

28 : Job ID 9231659e4d684738bc934c1ee0b125c2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (40, 19), end pos: (40, 21)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -37,7 +37,7 @@
         Validation.require_not_none(offer, "offer")
         listing: Optional[Listing] = self._listing_db.get_by_id(offer.listing_id)
-        if listing is None:
+        if listing is not None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
         if listing.is_sold:
             raise UnapprovedBehaviorError(
Initializing DBUtility...
Initializing DBUtility...

29 : Job ID 140be1906643430eaa9299d7dace36ab
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 33), end pos: (61, 35)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if existing.accepted is not True:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

30 : Job ID 53d4ac45777f44bfafa8cfd0573cd6fb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (156, 17), end pos: (156, 19)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -153,7 +153,7 @@
         Validation.is_boolean(accepted, "accepted")
         offer = self._offer_db.get_by_id(offer_id)
-        if offer is None:
+        if offer is not None:
             raise OfferNotFoundError(message=f"Offer {offer_id} not found.")
         listing = self._listing_db.get_by_id(offer.listing_id)
Initializing DBUtility...
Initializing DBUtility...

31 : Job ID ab65a7882afd480aae6ba7367bcffd50
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (160, 19), end pos: (160, 21)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -157,7 +157,7 @@
             raise OfferNotFoundError(message=f"Offer {offer_id} not found.")
         listing = self._listing_db.get_by_id(offer.listing_id)
-        if listing is None:
+        if listing is not None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
         if listing.seller_id != actor_id:
Initializing DBUtility...
Initializing DBUtility...

32 : Job ID 83ee01f619fb405884f78d648661f2d5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (55, 20), end pos: (55, 26)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -52,7 +52,7 @@
         existing: Optional[Offer] = self._offer_db.get_by_sender_and_listing(
             offer.sender_id, offer.listing_id
         )
-        if existing is not None:
+        if existing is None:
             if existing.is_pending:
                 raise ConflictError(
                     message="You already have a pending offer on this listing. "
Initializing DBUtility...
Initializing DBUtility...

33 : Job ID 42957e3f25624d629a8b827d67fa957f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (168, 11), end pos: (168, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -165,7 +165,7 @@
                 message="Only the seller of the listing can accept or decline offers."
             )
-        if not offer.is_pending:
+        if  offer.is_pending:
             raise UnapprovedBehaviorError(
                 message="This offer has already been resolved."
             )
Initializing DBUtility...
Initializing DBUtility...

34 : Job ID 9c603726c7094f83aebba18841519345
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (40, 11), end pos: (40, 26)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -37,7 +37,7 @@
         Validation.require_not_none(offer, "offer")
         listing: Optional[Listing] = self._listing_db.get_by_id(offer.listing_id)
-        if listing is None:
+        if not listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
         if listing.is_sold:
             raise UnapprovedBehaviorError(
Initializing DBUtility...
Initializing DBUtility...

35 : Job ID 686933d8e3164eceb735c3b286c52810
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (42, 11), end pos: (42, 26)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -39,7 +39,7 @@
         listing: Optional[Listing] = self._listing_db.get_by_id(offer.listing_id)
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.is_sold:
+        if not listing.is_sold:
             raise UnapprovedBehaviorError(
                 message="Cannot send an offer on a closed listing."
             )
Initializing DBUtility...
Initializing DBUtility...

36 : Job ID 18a311dd93d14d5392acc9fe707fb906
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (47, 11), end pos: (47, 47)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -44,7 +44,7 @@
                 message="Cannot send an offer on a closed listing."
             )
-        if listing.seller_id == offer.sender_id:
+        if not listing.seller_id == offer.sender_id:
             raise UnapprovedBehaviorError(
                 message="You cannot send an offer on your own listing."
             )
Initializing DBUtility...
Initializing DBUtility...
