96 : Job ID 94b840514f224ad197d39803142ad1f7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/account_service.py, start pos: (295, 39), end pos: (295, 42)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- asrc/business_logic/services/account_service.py
+++ bsrc/business_logic/services/account_service.py
@@ -292,7 +292,7 @@
         account = self.account_manager.get_account_by_id(userid)
         if account is None:
-            raise ApiError(status_code=404, message="Account not found")
+            raise ApiError(status_code= 403, message="Account not found")
         account.rating_count = self.rating_manager.count_ratings_received_by_account_id(
             userid
Initializing DBUtility...
Initializing DBUtility...
