37 : Job ID 513837a062454f8dbc207abfe534cde7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (55, 11), end pos: (55, 31)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -52,7 +52,7 @@
         existing: Optional[Offer] = self._offer_db.get_by_sender_and_listing(
             offer.sender_id, offer.listing_id
         )
-        if existing is not None:
+        if not existing is not None:
             if existing.is_pending:
                 raise ConflictError(
                     message="You already have a pending offer on this listing. "
Initializing DBUtility...
Initializing DBUtility...

38 : Job ID a876c9bd04c24343b2cebb30e97c57c0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (56, 15), end pos: (56, 34)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -53,7 +53,7 @@
             offer.sender_id, offer.listing_id
         )
         if existing is not None:
-            if existing.is_pending:
+            if not existing.is_pending:
                 raise ConflictError(
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
Initializing DBUtility...
Initializing DBUtility...

39 : Job ID 7dd9f2f9f81a43c7bcdcee7df33b5455
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 15), end pos: (61, 40)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if not existing.accepted is True:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

40 : Job ID 053d911f417a4d04b17db526dbed4b44
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (156, 11), end pos: (156, 24)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -153,7 +153,7 @@
         Validation.is_boolean(accepted, "accepted")
         offer = self._offer_db.get_by_id(offer_id)
-        if offer is None:
+        if not offer is None:
             raise OfferNotFoundError(message=f"Offer {offer_id} not found.")
         listing = self._listing_db.get_by_id(offer.listing_id)
Initializing DBUtility...
Initializing DBUtility...

41 : Job ID df642d2a7c454a1fa5550163d48b729d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (160, 11), end pos: (160, 26)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -157,7 +157,7 @@
             raise OfferNotFoundError(message=f"Offer {offer_id} not found.")
         listing = self._listing_db.get_by_id(offer.listing_id)
-        if listing is None:
+        if not listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
         if listing.seller_id != actor_id:
Initializing DBUtility...
Initializing DBUtility...

42 : Job ID a45ffda4eb20434ba783b4bf912a9838
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (163, 11), end pos: (163, 40)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -160,7 +160,7 @@
         if listing is None:
             raise ListingNotFoundError(message=f"Listing {offer.listing_id} not found.")
-        if listing.seller_id != actor_id:
+        if not listing.seller_id != actor_id:
             raise UnapprovedBehaviorError(
                 message="Only the seller of the listing can accept or decline offers."
             )
Initializing DBUtility...
Initializing DBUtility...

43 : Job ID e719ca9d0b7a4cbcb1516df435421596
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (168, 11), end pos: (168, 31)
operator: core/AddNot, occurrence: 9
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -165,7 +165,7 @@
                 message="Only the seller of the listing can accept or decline offers."
             )
-        if not offer.is_pending:
+        if not not offer.is_pending:
             raise UnapprovedBehaviorError(
                 message="This offer has already been resolved."
             )
Initializing DBUtility...
Initializing DBUtility...

44 : Job ID 2ed0be29d9ff42ce81b05da83a275f0c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (175, 11), end pos: (175, 19)
operator: core/AddNot, occurrence: 10
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -172,7 +172,7 @@
         self._offer_db.set_accepted(offer_id, accepted)
-        if accepted:
+        if not accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
                 if other.id != offer_id:
Initializing DBUtility...
Initializing DBUtility...

45 : Job ID e05a77aa046a4079aeb8e1889d8b01dc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (178, 19), end pos: (178, 39)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -175,7 +175,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
-                if other.id != offer_id:
+                if not other.id != offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

46 : Job ID d287741029ac42f79617ee6880efafe9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (61, 36), end pos: (61, 40)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -58,7 +58,7 @@
                     message="You already have a pending offer on this listing. "
                     "Wait for it to be rejected before sending another."
                 )
-            if existing.accepted is True:
+            if existing.accepted is False:
                 raise UnapprovedBehaviorError(
                     message="Your offer on this listing was already accepted."
                 )
Initializing DBUtility...
Initializing DBUtility...

47 : Job ID ad33692fdb904ab5a81653c2666d6f70
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (179, 58), end pos: (179, 63)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -176,7 +176,7 @@
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
             for other in pending_offers:
                 if other.id != offer_id:
-                    self._offer_db.set_accepted(other.id, False)
+                    self._offer_db.set_accepted(other.id, True)
     @override # pragma: no mutate
Initializing DBUtility...
Initializing DBUtility...

64 : Job ID e7121394953b4aa7baefb5249aca35ff
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (116, 23), end pos: (116, 31)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -113,7 +113,7 @@
         seller_id = Validation.require_int(seller_id, "seller_id")
         listings = self._listing_db.get_by_seller_id(seller_id)
         offers = []
-        for listing in listings:
+        for listing in []:
             offers.extend(self._offer_db.get_by_listing_id(listing.id))
         return offers
Initializing DBUtility...
Initializing DBUtility...

67 : Job ID 7540e96152724ed681e3b4c9610e78ff
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/offer/offer_manager.py, start pos: (177, 25), end pos: (177, 39)
operator: core/ZeroIterationForLoop, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/managers/offer/offer_manager.py
+++ bsrc/business_logic/managers/offer/offer_manager.py
@@ -174,7 +174,7 @@
         if accepted:
             pending_offers = self._offer_db.get_pending_by_listing_id(offer.listing_id)
-            for other in pending_offers:
+            for other in []:
                 if other.id != offer_id:
                     self._offer_db.set_accepted(other.id, False)
Initializing DBUtility...
Initializing DBUtility...

68 : Job ID 5d1c76c596d74feebb8e800819136bca
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/offer_service.py, start pos: (68, 17), end pos: (68, 19)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/offer_service.py
+++ bsrc/business_logic/services/offer_service.py
@@ -65,7 +65,7 @@
         seller != buyer, listing not already sold).
         """
         offer = self._offer_manager.get_offer_by_id(offer_id)
-        if offer is None:
+        if offer is not None:
             raise OfferNotFoundError(message=f"Offer {offer_id} not found.")
         self._offer_manager.set_offer_accepted(offer_id, accepted, actor_id)
Initializing DBUtility...
Initializing DBUtility...

69 : Job ID fd690e5b21184e16b337a63159f0a6ee
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/offer_service.py, start pos: (76, 23), end pos: (76, 25)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/services/offer_service.py
+++ bsrc/business_logic/services/offer_service.py
@@ -73,7 +73,7 @@
         if accepted:
             actor = self._account_manager.get_account_by_id(actor_id)
             listing = self._listing_manager.get_listing_by_id(offer.listing_id)
-            if listing is None:
+            if listing is not None:
                 raise ListingNotFoundError(
                     message=f"Listing {offer.listing_id} not found."
                 )
Initializing DBUtility...
Initializing DBUtility...

70 : Job ID 11b4557765ea4bf58880e8d5dad3f867
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/offer_service.py, start pos: (81, 21), end pos: (81, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/services/offer_service.py
+++ bsrc/business_logic/services/offer_service.py
@@ -78,7 +78,7 @@
                     message=f"Listing {offer.listing_id} not found."
                 )
             buyer = self._account_manager.get_account_by_id(offer.sender_id)
-            if buyer is None:
+            if buyer is not None:
                 raise UnapprovedBehaviorError(
                     message=f"Buyer account {offer.sender_id} not found."
                 )
Initializing DBUtility...
Initializing DBUtility...

71 : Job ID b1a5cbb8991e4caeb8e7c657c2a30156
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/offer_service.py, start pos: (68, 11), end pos: (68, 24)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/services/offer_service.py
+++ bsrc/business_logic/services/offer_service.py
@@ -65,7 +65,7 @@
         seller != buyer, listing not already sold).
         """
         offer = self._offer_manager.get_offer_by_id(offer_id)
-        if offer is None:
+        if not offer is None:
             raise OfferNotFoundError(message=f"Offer {offer_id} not found.")
         self._offer_manager.set_offer_accepted(offer_id, accepted, actor_id)
Initializing DBUtility...
Initializing DBUtility...

72 : Job ID c437c37d5fca461b8d8e46266fc27543
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/offer_service.py, start pos: (73, 11), end pos: (73, 19)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/services/offer_service.py
+++ bsrc/business_logic/services/offer_service.py
@@ -70,7 +70,7 @@
         self._offer_manager.set_offer_accepted(offer_id, accepted, actor_id)
-        if accepted:
+        if not accepted:
             actor = self._account_manager.get_account_by_id(actor_id)
             listing = self._listing_manager.get_listing_by_id(offer.listing_id)
             if listing is None:
Initializing DBUtility...
Initializing DBUtility...

73 : Job ID 666537f1759f41ffad082fb6db1e65a9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/offer_service.py, start pos: (76, 15), end pos: (76, 30)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/services/offer_service.py
+++ bsrc/business_logic/services/offer_service.py
@@ -73,7 +73,7 @@
         if accepted:
             actor = self._account_manager.get_account_by_id(actor_id)
             listing = self._listing_manager.get_listing_by_id(offer.listing_id)
-            if listing is None:
+            if not listing is None:
                 raise ListingNotFoundError(
                     message=f"Listing {offer.listing_id} not found."
                 )
Initializing DBUtility...
Initializing DBUtility...

74 : Job ID 65ba4aa6fc75452e9bfd810b8e6fe20f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/services/offer_service.py, start pos: (81, 15), end pos: (81, 28)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/services/offer_service.py
+++ bsrc/business_logic/services/offer_service.py
@@ -78,7 +78,7 @@
                     message=f"Listing {offer.listing_id} not found."
                 )
             buyer = self._account_manager.get_account_by_id(offer.sender_id)
-            if buyer is None:
+            if not buyer is None:
                 raise UnapprovedBehaviorError(
                     message=f"Buyer account {offer.sender_id} not found."
                 )
Initializing DBUtility...
Initializing DBUtility...
