1 : Job ID 0f7a642d2a644721b7a861eb2b171765
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_Add, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str + None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

2 : Job ID c5074589f5c446488becc11c9ac9e93b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_Add, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str + None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

3 : Job ID 07d79e6b2a9d4e16961cc173784b7eea
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_Sub, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str - None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

4 : Job ID d2a8b08f2e034c8f86e0622229d41830
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_Sub, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str - None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

5 : Job ID ed4cf83dfac24cc6afdc9382e0563296
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_Mul, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str * None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

6 : Job ID e87613c317c74a85bef0888be2588be0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_Mul, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str * None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

7 : Job ID 5bcdedd56e414686844545194c3e155b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_Div, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str / None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

8 : Job ID e0c4ee9fe3684412923826910096585b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_Div, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str / None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

9 : Job ID fe0a6386737247faa321059a102762e3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_FloorDiv, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str // None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

10 : Job ID ce24a568e3ff47fcb02885b65a365008
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_FloorDiv, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str // None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

11 : Job ID 8ac7265197b54428bd6effcdddedfaa0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_Mod, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str % None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

12 : Job ID 7c838a98f7424aad89f2945e598b198e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_Mod, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str % None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

13 : Job ID 06a8515572194b3ca1bde26addfa62b4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_Pow, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str ** None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

14 : Job ID fdaab3e775ad4d7ba00f23505e84e53f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_Pow, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str ** None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

15 : Job ID 703446080b3e4237849fa6a17e19c252
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_RShift, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str >> None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

16 : Job ID 912908d2d6a14d3fa78ccc3f6f68b3ff
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_RShift, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str >> None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

17 : Job ID 23b7076ebfdf4606bfe6bb2dce83d251
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_LShift, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str << None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

18 : Job ID 57376726d9474dd8ae371a343638e902
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_LShift, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str << None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

19 : Job ID 16c3f71b989244df992b68c12c868244
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_BitAnd, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str & None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

20 : Job ID 390acc66d178460ca266a99bdc714cc0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_BitAnd, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str & None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

21 : Job ID a0be1acd487f4e29be8805a39284fa92
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 20), end pos: (118, 21)
operator: core/ReplaceBinaryOperator_BitOr_BitXor, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str ^ None = Query(None, min_length=10),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):

22 : Job ID 82f1a111152346f5a11f1379c558320d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 15), end pos: (119, 16)
operator: core/ReplaceBinaryOperator_BitOr_BitXor, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str ^ None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
     """

23 : Job ID fad5dfea78874e1bab5469cbbb31e987
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (128, 11), end pos: (128, 14)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -125,7 +125,7 @@
     """
     try:
         verification_token = auth_token or token
-        if not verification_token:
+        if  verification_token:
             return JSONResponse(
                 status_code=400,
                 content={"error_message": "No verification auth_token provided."},
Initializing DBUtility...
Initializing DBUtility...

24 : Job ID dfbd693ca8ec4344a168afcf3f6b7453
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (128, 11), end pos: (128, 33)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -125,7 +125,7 @@
     """
     try:
         verification_token = auth_token or token
-        if not verification_token:
+        if not not verification_token:
             return JSONResponse(
                 status_code=400,
                 content={"error_message": "No verification auth_token provided."},
Initializing DBUtility...
Initializing DBUtility...

25 : Job ID 38af68a1ea134d8d899cc0d19866f818
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (127, 40), end pos: (127, 42)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -124,7 +124,7 @@
     Supports legacy token query parameter for backwards compatibility.
     """
     try:
-        verification_token = auth_token or token
+        verification_token = auth_token and token
         if not verification_token:
             return JSONResponse(
                 status_code=400,
Initializing DBUtility...
Initializing DBUtility...

26 : Job ID b2d463ff15ab449083c21e27e97cd2e4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (74, 11), end pos: (74, 20)
operator: core/ExceptionReplacer, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -71,7 +71,7 @@
             verification_link=verification_link,
         )
-    except Exception as e:
+    except CosmicRayTestingException as e:
         logger.error(f"Failed to create account: {e}")
         return JSONResponse(status_code=500, content={"error_message": str(e)})
Initializing DBUtility...
Initializing DBUtility...

27 : Job ID c234e2e428d54528a86368b9897e63a2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (147, 8), end pos: (147, 26)
operator: core/ExceptionReplacer, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -144,7 +144,7 @@
         )
     except (
-        TokenNotFoundError,
+        CosmicRayTestingException,
         TokenExpiredError,
         TokenAlreadyUsedError,
         EmailVerificationError,
Initializing DBUtility...
Initializing DBUtility...

28 : Job ID 5ce1dcfa6c0f406ab7cd759dbf9a1c63
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (148, 8), end pos: (148, 25)
operator: core/ExceptionReplacer, occurrence: 2
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -145,7 +145,7 @@
     except (
         TokenNotFoundError,
-        TokenExpiredError,
+        CosmicRayTestingException,
         TokenAlreadyUsedError,
         EmailVerificationError,
     ) as e:
Initializing DBUtility...
Initializing DBUtility...

29 : Job ID bbe4f4ac2e474390874b6e22c68534c7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (149, 8), end pos: (149, 29)
operator: core/ExceptionReplacer, occurrence: 3
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -146,7 +146,7 @@
     except (
         TokenNotFoundError,
         TokenExpiredError,
-        TokenAlreadyUsedError,
+        CosmicRayTestingException,
         EmailVerificationError,
     ) as e:
         logger.warning(f"Email verification failed: {e.message}")
Initializing DBUtility...
Initializing DBUtility...

30 : Job ID 4556e2db263a4b928d2c0a142865617f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (150, 8), end pos: (150, 30)
operator: core/ExceptionReplacer, occurrence: 4
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -147,7 +147,7 @@
         TokenNotFoundError,
         TokenExpiredError,
         TokenAlreadyUsedError,
-        EmailVerificationError,
+        CosmicRayTestingException,
     ) as e:
         logger.warning(f"Email verification failed: {e.message}")
         return JSONResponse(
Initializing DBUtility...
Initializing DBUtility...

32 : Job ID 2b5fe2c1f6f545f1b7073f15eaa72ec3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (59, 85), end pos: (59, 86)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -56,7 +56,7 @@
         # Generate verification auth_token and create link
         # NOTE: In production, this would be done after saving to DB
         # For now, using a mock account_id for demonstration
-        raw_token = account_service.generate_and_store_verification_token(account_id=1)
+        raw_token = account_service.generate_and_store_verification_token(account_id= 2)
         # Create verification link
         verification_link = f"{FRONTEND_URL}/verify-email?auth_token={raw_token}"
Initializing DBUtility...
Initializing DBUtility...

33 : Job ID b303a328ae63406aaa9e9ffd9791fea6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (59, 85), end pos: (59, 86)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -56,7 +56,7 @@
         # Generate verification auth_token and create link
         # NOTE: In production, this would be done after saving to DB
         # For now, using a mock account_id for demonstration
-        raw_token = account_service.generate_and_store_verification_token(account_id=1)
+        raw_token = account_service.generate_and_store_verification_token(account_id= 0)
         # Create verification link
         verification_link = f"{FRONTEND_URL}/verify-email?auth_token={raw_token}"
Initializing DBUtility...
Initializing DBUtility...

34 : Job ID 0b7ccca26e0a424d90f78c8fb2e681e5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (76, 40), end pos: (76, 43)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -73,7 +73,7 @@
     except Exception as e:
         logger.error(f"Failed to create account: {e}")
-        return JSONResponse(status_code=500, content={"error_message": str(e)})
+        return JSONResponse(status_code= 501, content={"error_message": str(e)})
 @router.post("/login", response_model=Token)
Initializing DBUtility...
Initializing DBUtility...

35 : Job ID 7d8f312a9d89459395a2801d7571dc6c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (76, 40), end pos: (76, 43)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -73,7 +73,7 @@
     except Exception as e:
         logger.error(f"Failed to create account: {e}")
-        return JSONResponse(status_code=500, content={"error_message": str(e)})
+        return JSONResponse(status_code= 499, content={"error_message": str(e)})
 @router.post("/login", response_model=Token)
Initializing DBUtility...
Initializing DBUtility...

36 : Job ID 5191457259564d9a9426c505f80e37ff
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 52), end pos: (118, 54)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str | None = Query(None, min_length= 11),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
Initializing DBUtility...
Initializing DBUtility...

37 : Job ID b4f442b9f39545b1ad5a11b9ed403b94
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (118, 52), end pos: (118, 54)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -115,7 +115,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
-    auth_token: str | None = Query(None, min_length=10),
+    auth_token: str | None = Query(None, min_length= 9),
     token: str | None = Query(None, min_length=10),
     account_service: AccountService = Depends(get_account_service),
 ):
Initializing DBUtility...
Initializing DBUtility...

38 : Job ID 5247e908c7a149a2a59792f4592abd23
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 47), end pos: (119, 49)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str | None = Query(None, min_length= 11),
     account_service: AccountService = Depends(get_account_service),
 ):
     """
Initializing DBUtility...
Initializing DBUtility...

39 : Job ID f484125a94be4d2e81a68a9b22a7c954
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (119, 47), end pos: (119, 49)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -116,7 +116,7 @@
 @router.get("/verify-email", response_model=VerifyEmailResponse)
 def verify_email(
     auth_token: str | None = Query(None, min_length=10),
-    token: str | None = Query(None, min_length=10),
+    token: str | None = Query(None, min_length= 9),
     account_service: AccountService = Depends(get_account_service),
 ):
     """
Initializing DBUtility...
Initializing DBUtility...

40 : Job ID 2bad21bcecef4e0eb45364f20f02f9e3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (130, 28), end pos: (130, 31)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -127,7 +127,7 @@
         verification_token = auth_token or token
         if not verification_token:
             return JSONResponse(
-                status_code=400,
+                status_code= 401,
                 content={"error_message": "No verification auth_token provided."},
             )
Initializing DBUtility...
Initializing DBUtility...

41 : Job ID e10fb0d396ab4fba9dccf9308728ed4c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (130, 28), end pos: (130, 31)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -127,7 +127,7 @@
         verification_token = auth_token or token
         if not verification_token:
             return JSONResponse(
-                status_code=400,
+                status_code= 399,
                 content={"error_message": "No verification auth_token provided."},
             )
Initializing DBUtility...
Initializing DBUtility...

42 : Job ID 38b697d816f2413e83ea74eb5f190959
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (159, 24), end pos: (159, 27)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -156,7 +156,7 @@
     except Exception as e:
         logger.error(f"Unexpected error during email verification: {e}")
         return JSONResponse(
-            status_code=500,
+            status_code= 501,
             content={"error_message": "An error occurred during verification"},
         )
Initializing DBUtility...
Initializing DBUtility...

43 : Job ID 6146f3a344694dc4bd324ae2c436eaeb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/account_routes.py, start pos: (159, 24), end pos: (159, 27)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- asrc/api/routes/account_routes.py
+++ bsrc/api/routes/account_routes.py
@@ -156,7 +156,7 @@
     except Exception as e:
         logger.error(f"Unexpected error during email verification: {e}")
         return JSONResponse(
-            status_code=500,
+            status_code= 499,
             content={"error_message": "An error occurred during verification"},
         )
Initializing DBUtility...
Initializing DBUtility...
