71 : Job ID ef227d20c6a94612901dfdc0598aa8b4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/rating/rating_manager.py, start pos: (55, 47), end pos: (55, 49)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asrc/business_logic/managers/rating/rating_manager.py
+++ bsrc/business_logic/managers/rating/rating_manager.py
@@ -52,7 +52,7 @@
         return self._rating_db.get_all()
     @override # pragma: no mutate
-    def list_recent_ratings(self, limit: int = 50, offset: int = 0) -> List[Rating]:
+    def list_recent_ratings(self, limit: int = 51, offset: int = 0) -> List[Rating]:
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
         return self._rating_db.get_recent(limit=limit, offset=offset)
Initializing DBUtility...
Initializing DBUtility...

72 : Job ID 4a0ed98bcc2b47efa4d486435557b44e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/rating/rating_manager.py, start pos: (55, 47), end pos: (55, 49)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asrc/business_logic/managers/rating/rating_manager.py
+++ bsrc/business_logic/managers/rating/rating_manager.py
@@ -52,7 +52,7 @@
         return self._rating_db.get_all()
     @override # pragma: no mutate
-    def list_recent_ratings(self, limit: int = 50, offset: int = 0) -> List[Rating]:
+    def list_recent_ratings(self, limit: int = 49, offset: int = 0) -> List[Rating]:
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
         return self._rating_db.get_recent(limit=limit, offset=offset)
Initializing DBUtility...
Initializing DBUtility...

73 : Job ID 9131f5245b244fc494884f7337224246
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/rating/rating_manager.py, start pos: (55, 65), end pos: (55, 66)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- asrc/business_logic/managers/rating/rating_manager.py
+++ bsrc/business_logic/managers/rating/rating_manager.py
@@ -52,7 +52,7 @@
         return self._rating_db.get_all()
     @override # pragma: no mutate
-    def list_recent_ratings(self, limit: int = 50, offset: int = 0) -> List[Rating]:
+    def list_recent_ratings(self, limit: int = 50, offset: int = 1) -> List[Rating]:
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
         return self._rating_db.get_recent(limit=limit, offset=offset)
Initializing DBUtility...
Initializing DBUtility...

74 : Job ID bc6791cbfc3c4bb7aecec1fca48f91dd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/business_logic/managers/rating/rating_manager.py, start pos: (55, 65), end pos: (55, 66)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- asrc/business_logic/managers/rating/rating_manager.py
+++ bsrc/business_logic/managers/rating/rating_manager.py
@@ -52,7 +52,7 @@
         return self._rating_db.get_all()
     @override # pragma: no mutate
-    def list_recent_ratings(self, limit: int = 50, offset: int = 0) -> List[Rating]:
+    def list_recent_ratings(self, limit: int = 50, offset: int = -1) -> List[Rating]:
         limit = Validation.require_int(limit, "limit")
         offset = Validation.require_int(offset, "offset")
         return self._rating_db.get_recent(limit=limit, offset=offset)
Initializing DBUtility...
Initializing DBUtility...

92 : Job ID 31280ab9690c46e6aa28af13a5fdd574
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/rating_converter.py, start pos: (9, 44), end pos: (9, 45)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asrc/api/converter/rating_converter.py
+++ bsrc/api/converter/rating_converter.py
@@ -6,7 +6,7 @@
 class RatingCreate(BaseModel):
     """Data model for creating a new rating."""
-    transaction_rating: int = Field(..., ge=1, le=5)
+    transaction_rating: int = Field(..., ge= 2, le=5)
 class RatingResponse(BaseModel):
Initializing DBUtility...
Initializing DBUtility...

93 : Job ID 422c1a57563a4236ab84e56db91a932d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/rating_converter.py, start pos: (9, 44), end pos: (9, 45)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asrc/api/converter/rating_converter.py
+++ bsrc/api/converter/rating_converter.py
@@ -6,7 +6,7 @@
 class RatingCreate(BaseModel):
     """Data model for creating a new rating."""
-    transaction_rating: int = Field(..., ge=1, le=5)
+    transaction_rating: int = Field(..., ge= 0, le=5)
 class RatingResponse(BaseModel):
Initializing DBUtility...
Initializing DBUtility...

94 : Job ID c1fdc4f7cba64aa6bcac17ab21444889
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/rating_converter.py, start pos: (9, 50), end pos: (9, 51)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- asrc/api/converter/rating_converter.py
+++ bsrc/api/converter/rating_converter.py
@@ -6,7 +6,7 @@
 class RatingCreate(BaseModel):
     """Data model for creating a new rating."""
-    transaction_rating: int = Field(..., ge=1, le=5)
+    transaction_rating: int = Field(..., ge=1, le= 6)
 class RatingResponse(BaseModel):
Initializing DBUtility...
Initializing DBUtility...

95 : Job ID ce8d0cbda671448688b3ff41abbbb08c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/converter/rating_converter.py, start pos: (9, 50), end pos: (9, 51)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- asrc/api/converter/rating_converter.py
+++ bsrc/api/converter/rating_converter.py
@@ -6,7 +6,7 @@
 class RatingCreate(BaseModel):
     """Data model for creating a new rating."""
-    transaction_rating: int = Field(..., ge=1, le=5)
+    transaction_rating: int = Field(..., ge=1, le= 4)
 class RatingResponse(BaseModel):
Initializing DBUtility...
Initializing DBUtility...
