1 : Job ID 2a97824a4afd42648df8de3c03e7c9c1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_Add, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile + None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

3 : Job ID 8dcc11b4c2ce428e834e1cc5210d9cb4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_Sub, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile - None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

5 : Job ID dac4eb0a45434562821e7ee1fc5fa8dc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_Mul, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile * None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

7 : Job ID b0a61754c1c34baf8eaccd8967d712bf
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_Div, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile / None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

9 : Job ID a0071dc20a404388a90e5359c448fdd0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_FloorDiv, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile // None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

11 : Job ID 84c0b3e990f444b8b0ba8372f7eccc91
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_Mod, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile % None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

13 : Job ID 6eacb2aa188a4d65ba9ba262072e3f27
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_Pow, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile ** None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

15 : Job ID dedf84eb0194484b9e9b49ad3f83d9bc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_RShift, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile >> None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

17 : Job ID 05f3c483e0da46d7b63a435ab97326b6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_LShift, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile << None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

19 : Job ID 621517f050314946a5b0774f43c01670
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_BitAnd, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile & None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

21 : Job ID ee4854f76db14b93b1187c44e9d2c416
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (138, 22), end pos: (138, 23)
operator: core/ReplaceBinaryOperator_BitOr_BitXor, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -135,7 +135,7 @@
     description: str = Form(...),
     price: float = Form(...),
     location: str = Form(...),
-    image: UploadFile | None = File(default=None),
+    image: UploadFile ^ None = File(default=None),
     user_id: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),

23 : Job ID 267c9acb06f14e5eaea9398328ba0356
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (219, 14), end pos: (219, 16)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -216,7 +216,7 @@
     listing_service: ListingService = Depends(get_listing_service),
 ):
     rating = listing_service.get_listing_rating(listing_id)
-    if rating is None:
+    if rating is not None:
         return None
     return RatingResponse.from_domain(rating)
Initializing DBUtility...
Initializing DBUtility...

24 : Job ID cbaa0ce0dc3d466ea794b503aaba972f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (145, 13), end pos: (145, 19)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -142,7 +142,7 @@
 ):
     image_key = None
-    if image is not None:
+    if image is None:
         try:
             image_key = await _upload_listing_image(image, media_storage)
         except ValueError as exc:
Initializing DBUtility...
Initializing DBUtility...

25 : Job ID 385f489ba20f4c1aaf8b74b8a1d2b9eb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (57, 7), end pos: (57, 10)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -54,7 +54,7 @@
     upload: UploadFile,
     media_storage: MediaStorageUtility,
 ) -> str:
-    if not (upload.content_type or "").startswith("image/"):
+    if  (upload.content_type or "").startswith("image/"):
         raise ValueError("Uploaded file must be an image.")
     ext = _normalized_image_extension(upload)
Initializing DBUtility...
Initializing DBUtility...

26 : Job ID d397645abb894643b5a84cc47ee49327
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (41, 7), end pos: (41, 24)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -38,7 +38,7 @@
 def _normalized_image_extension(upload: UploadFile) -> str:
     allowed = {".jpg", ".jpeg", ".png", ".gif", ".webp"}
     suffix = Path(upload.filename or "").suffix.lower()
-    if suffix in allowed:
+    if not suffix in allowed:
         return suffix
     by_content_type = {
Initializing DBUtility...
Initializing DBUtility...

27 : Job ID 61d3f3b25f86477eb034f4d426679394
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (57, 7), end pos: (57, 59)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -54,7 +54,7 @@
     upload: UploadFile,
     media_storage: MediaStorageUtility,
 ) -> str:
-    if not (upload.content_type or "").startswith("image/"):
+    if not not (upload.content_type or "").startswith("image/"):
         raise ValueError("Uploaded file must be an image.")
     ext = _normalized_image_extension(upload)
Initializing DBUtility...
Initializing DBUtility...

28 : Job ID e0cbd5b592c24ae7898ead09fbe30f5b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (145, 7), end pos: (145, 24)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -142,7 +142,7 @@
 ):
     image_key = None
-    if image is not None:
+    if not image is not None:
         try:
             image_key = await _upload_listing_image(image, media_storage)
         except ValueError as exc:
Initializing DBUtility...
Initializing DBUtility...

29 : Job ID 94adab3c4446430d99a36b72f3f85ac1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (219, 7), end pos: (219, 21)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -216,7 +216,7 @@
     listing_service: ListingService = Depends(get_listing_service),
 ):
     rating = listing_service.get_listing_rating(listing_id)
-    if rating is None:
+    if not rating is None:
         return None
     return RatingResponse.from_domain(rating)
Initializing DBUtility...
Initializing DBUtility...

30 : Job ID 81eadc9a5e4d43f4bb53a75480e65b70
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (40, 34), end pos: (40, 36)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -37,7 +37,7 @@
 def _normalized_image_extension(upload: UploadFile) -> str:
     allowed = {".jpg", ".jpeg", ".png", ".gif", ".webp"}
-    suffix = Path(upload.filename or "").suffix.lower()
+    suffix = Path(upload.filename and "").suffix.lower()
     if suffix in allowed:
         return suffix
Initializing DBUtility...
Initializing DBUtility...

31 : Job ID 7fdd4a0ae9bf46ab8dc59b535c956376
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (50, 51), end pos: (50, 53)
operator: core/ReplaceOrWithAnd, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -47,7 +47,7 @@
         "image/gif": ".gif",
         "image/webp": ".webp",
     }
-    return by_content_type.get(upload.content_type or "", ".jpg")
+    return by_content_type.get(upload.content_type and "", ".jpg")
 async def _upload_listing_image(
Initializing DBUtility...
Initializing DBUtility...

32 : Job ID a2ec2394bc62402ab07ff2024d3dc6b6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (57, 32), end pos: (57, 34)
operator: core/ReplaceOrWithAnd, occurrence: 2
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -54,7 +54,7 @@
     upload: UploadFile,
     media_storage: MediaStorageUtility,
 ) -> str:
-    if not (upload.content_type or "").startswith("image/"):
+    if not (upload.content_type and "").startswith("image/"):
         raise ValueError("Uploaded file must be an image.")
     ext = _normalized_image_extension(upload)
Initializing DBUtility...
Initializing DBUtility...

33 : Job ID c4bb79fbcef64c8690960d9aa0c7d443
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (67, 41), end pos: (67, 43)
operator: core/ReplaceOrWithAnd, occurrence: 3
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -64,7 +64,7 @@
     return media_storage.upload_bytes(
         key=key,
         data=data,
-        content_type=upload.content_type or "application/octet-stream",
+        content_type=upload.content_type and "application/octet-stream",
     )
Initializing DBUtility...
Initializing DBUtility...

34 : Job ID 4d5c44d0cc034b179a8c4627823c8d7e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (148, 15), end pos: (148, 25)
operator: core/ExceptionReplacer, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -145,7 +145,7 @@
     if image is not None:
         try:
             image_key = await _upload_listing_image(image, media_storage)
-        except ValueError as exc:
+        except CosmicRayTestingException as exc:
             raise HTTPException(
                 status_code=status.HTTP_400_BAD_REQUEST,
                 detail=str(exc),
Initializing DBUtility...
Initializing DBUtility...

35 : Job ID 7ead96d6ca244012bf82b77589e7f23e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (93, 35), end pos: (93, 36)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -90,7 +90,7 @@
 @router.get("/search", response_model=List[ListingResponse])
 def search_listings(
-    q: str = Query(..., min_length=1),
+    q: str = Query(..., min_length= 2),
     _: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),
Initializing DBUtility...
Initializing DBUtility...

36 : Job ID 5adadcfd5fc74e37b070a53657a2ca87
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
src/api/routes/listing_routes.py, start pos: (93, 35), end pos: (93, 36)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- asrc/api/routes/listing_routes.py
+++ bsrc/api/routes/listing_routes.py
@@ -90,7 +90,7 @@
 @router.get("/search", response_model=List[ListingResponse])
 def search_listings(
-    q: str = Query(..., min_length=1),
+    q: str = Query(..., min_length= 0),
     _: int = Depends(get_current_user_id),
     listing_service: ListingService = Depends(get_listing_service),
     media_storage: MediaStorageUtility = Depends(get_media_storage),
Initializing DBUtility...
Initializing DBUtility...
